Repository: marcel-galliker/Mouvent-PrintEngine
Catalog: mvt_digiprint_gui/Resources/Language/Resources.*.resx
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pl_pl, ro_ro

# ESTOP 05
source: ESTOP 05: Printer
de_de: NOT-AUS 05: Drucker
es_es: PARADA DE EMERGENCIA 05: Impresora
fr_fr: COMMUTATEUR D’ARRÊT 05 : Imprimante

# ESTOP 06
source: ESTOP 06: Dryer
de_de: NOT-AUS 06: Trockner
es_es: PARADA DE EMERGENCIA 06: Secador
fr_fr: COMMUTATEUR D’ARRÊT 06 : Séchoir

# ESTOP 07
source: ESTOP 07: Dryer
de_de: NOT-AUS 07: Trockner
es_es: PARADA DE EMERGENCIA 07: Secador
fr_fr: COMMUTATEUR D’ARRÊT 07 : Séchoir

# ESTOP 08
source: ESTOP 08: Rewinder
de_de: NOT-AUS 08: Aufwickler
es_es: PARADA DE EMERGENCIA 08: Rebobinadora
fr_fr: COMMUTATEUR D’ARRÊT 08 : Enrouleur

# ESTOP 09
source: ESTOP 09: Rewinder
de_de: NOT-AUS 09: Aufwickler
es_es: PARADA DE EMERGENCIA 09: Rebobinadora
fr_fr: COMMUTATEUR D’ARRÊT 09 : Enrouleur

source: ESTOP 10:
de_de: NOT-AUS 10:
es_es: PARADA DE EMERGENCIA 10:
fr_fr: COMMUTATEUR D’ARRÊT 10 :

source: ESTOP 11:
de_de: NOT-AUS 11:
es_es: PARADA DE EMERGENCIA 11:
fr_fr: COMMUTATEUR D’ARRÊT 11 :

source: ESTOP 12:
de_de: NOT-AUS 12:
es_es: PARADA DE EMERGENCIA 12:
fr_fr: COMMUTATEUR D’ARRÊT 12 :

source: ESTOP 13:
de_de: NOT-AUS 13:
es_es: PARADA DE EMERGENCIA 13:
fr_fr: COMMUTATEUR D’ARRÊT 13 :

source: ESTOP 14:
de_de: NOT-AUS 14:
es_es: PARADA DE EMERGENCIA 14:
fr_fr: COMMUTATEUR D’ARRÊT 14 :

source: ESTOP 15:
de_de: NOT-AUS 15:
es_es: PARADA DE EMERGENCIA 15:
fr_fr: COMMUTATEUR D’ARRÊT 15 :

source: ESTOP 16:
de_de: NOT-AUS 16:
es_es: PARADA DE EMERGENCIA 16:
fr_fr: COMMUTATEUR D’ARRÊT 16 :

source: ESTOP 17:
de_de: NOT-AUS 17:
es_es: PARADA DE EMERGENCIA 17:
fr_fr: COMMUTATEUR D’ARRÊT 17 :

source: ESTOP 18:
de_de: NOT-AUS 18:
es_es: PARADA DE EMERGENCIA 18:
fr_fr: COMMUTATEUR D’ARRÊT 18 :

source: ESTOP 19:
de_de: NOT-AUS 19:
es_es: PARADA DE EMERGENCIA 19:
fr_fr: COMMUTATEUR D’ARRÊT 19 :

source: ESTOP 20:
de_de: NOT-AUS 20:
es_es: PARADA DE EMERGENCIA 20:
fr_fr: COMMUTATEUR D’ARRÊT 20 :

source: ESTOP 21:
de_de: NOT-AUS 21:
es_es: PARADA DE EMERGENCIA 21:
fr_fr: COMMUTATEUR D’ARRÊT 21 :

source: ESTOP 22:
de_de: NOT-AUS 22:
es_es: PARADA DE EMERGENCIA 22:
fr_fr: COMMUTATEUR D’ARRÊT 22 :

source: ESTOP 23:
de_de: NOT-AUS 23:
es_es: PARADA DE EMERGENCIA 23:
fr_fr: COMMUTATEUR D’ARRÊT 23 :

source: ESTOP 24:
de_de: NOT-AUS 24:
es_es: PARADA DE EMERGENCIA 24:
fr_fr: COMMUTATEUR D’ARRÊT 24 :

source: ESTOP 25:
de_de: NOT-AUS 25:
es_es: PARADA DE EMERGENCIA 25:
fr_fr: COMMUTATEUR D’ARRÊT 25 :

source: ESTOP 26:
de_de: NOT-AUS 26:
es_es: PARADA DE EMERGENCIA 26:
fr_fr: COMMUTATEUR D’ARRÊT 26 :

source: ESTOP 27:
de_de: NOT-AUS 27:
es_es: PARADA DE EMERGENCIA 27:
fr_fr: COMMUTATEUR D’ARRÊT 27 :

source: ESTOP 28:
de_de: NOT-AUS 28:
es_es: PARADA DE EMERGENCIA 28:
fr_fr: COMMUTATEUR D’ARRÊT 28 :

source: ESTOP 29:
de_de: NOT-AUS 29:
es_es: PARADA DE EMERGENCIA 29:
fr_fr: COMMUTATEUR D’ARRÊT 29 :

source: ESTOP 30:
de_de: NOT-AUS 30:
es_es: PARADA DE EMERGENCIA 30:
fr_fr: COMMUTATEUR D’ARRÊT 30 :

source: ESTOP 31:
de_de: NOT-AUS 31:
es_es: PARADA DE EMERGENCIA 31:
fr_fr: COMMUTATEUR D’ARRÊT 31 :

source: ESTOP 32:
de_de: NOT-AUS 32:
es_es: PARADA DE EMERGENCIA 32:
fr_fr: COMMUTATEUR D’ARRÊT 32 :

source: Fill cap
de_de: Füllkappe
es_es: Llenar tapa
fr_fr: Bouchon de remplissage

source: Standstill
de_de: Stillstand
es_es: Parada
fr_fr: Arrêt

source: WARN 01:
es_es: ADVERTENCIA 01:
fr_fr: AVERTISSEMENT 01 :

source: WARN 02:
es_es: ADVERTENCIA 02:
fr_fr: AVERTISSEMENT 02 :

source: WARN 03:
es_es: ADVERTENCIA 03:
fr_fr: AVERTISSEMENT 03 :

source: WARN 04:
es_es: ADVERTENCIA 04:
fr_fr: AVERTISSEMENT 04 :

source: WARN 05:
es_es: ADVERTENCIA 05:
fr_fr: AVERTISSEMENT 05 :

source: WARN 06:
es_es: ADVERTENCIA 06:
fr_fr: AVERTISSEMENT 06 :

source: WARN 07:
es_es: ADVERTENCIA 07:
fr_fr: AVERTISSEMENT 07 :

source: WARN 08:
es_es: ADVERTENCIA 08:
fr_fr: AVERTISSEMENT 08 :

source: WARN 09:
es_es: ADVERTENCIA 09:
fr_fr: AVERTISSEMENT 09 :

source: WARN 10:
es_es: ADVERTENCIA 10:
fr_fr: AVERTISSEMENT 10 :

source: WARN 11:
es_es: ADVERTENCIA 11:
fr_fr: AVERTISSEMENT 11 :

source: WARN 12:
es_es: ADVERTENCIA 12:
fr_fr: AVERTISSEMENT 12 :

source: WARN 13:
es_es: ADVERTENCIA 13:
fr_fr: AVERTISSEMENT 13 :

source: WARN 14:
es_es: ADVERTENCIA 14:
fr_fr: AVERTISSEMENT 14 :

source: WARN 15:
es_es: ADVERTENCIA 15:
fr_fr: AVERTISSEMENT 15 :

source: WARN 16:
es_es: ADVERTENCIA 16:
fr_fr: AVERTISSEMENT 16 :

source: WARN 17:
es_es: ADVERTENCIA 17:
fr_fr: AVERTISSEMENT 17 :

source: WARN 18:
es_es: ADVERTENCIA 18:
fr_fr: AVERTISSEMENT 18 :

source: WARN 19:
es_es: ADVERTENCIA 19:
fr_fr: AVERTISSEMENT 19 :

source: WARN 20:
es_es: ADVERTENCIA 20:
fr_fr: AVERTISSEMENT 20 :

source: WARN 21:
es_es: ADVERTENCIA 21:
fr_fr: AVERTISSEMENT 21 :

source: WARN 22:
es_es: ADVERTENCIA 22:
fr_fr: AVERTISSEMENT 22 :

source: WARN 23:
es_es: ADVERTENCIA 23:
fr_fr: AVERTISSEMENT 23 :

source: WARN 24:
es_es: ADVERTENCIA 24:
fr_fr: AVERTISSEMENT 24 :

source: WARN 25:
es_es: ADVERTENCIA 25:
fr_fr: AVERTISSEMENT 25 :

source: WARN 26:
es_es: ADVERTENCIA 26:
fr_fr: AVERTISSEMENT 26 :

source: WARN 27:
es_es: ADVERTENCIA 27:
fr_fr: AVERTISSEMENT 27 :

source: WARN 28:
es_es: ADVERTENCIA 28:
fr_fr: AVERTISSEMENT 28 :

source: WARN 29:
es_es: ADVERTENCIA 29:
fr_fr: AVERTISSEMENT 29 :

source: WARN 30:
es_es: ADVERTENCIA 30:
fr_fr: AVERTISSEMENT 30 :

source: WARN 31:
es_es: ADVERTENCIA 31:
fr_fr: AVERTISSEMENT 31 :

source: WARN 32:
es_es: ADVERTENCIA 32:
fr_fr: AVERTISSEMENT 32 :

source: Center
de_de: Mitte
es_es: Centrar
fr_fr: Centre

source: Splice Mode
de_de: Spleißmodus
es_es: Modo empalme
fr_fr: Mode source

source: Bar
fr_fr: Barre
nl_nl: Balk
ro_ro: Bară

source: Buses
de_de: Sammelleitungen
fr_fr: Bus
it_it: Bus
nl_nl: Bussen
pl_pl: Magistrale
ro_ro: Duze

source: C.L. Gain Fact
fr_fr: Coefficient d’élargissement C.L.

source: Color
de_de: Farbe
fr_fr: Couleur
it_it: Colore
nl_nl: Kleur
pl_pl: Kolor
ro_ro: Culoare

source: Error
de_de: Fehler
fr_fr: Erreur

source: Flexo
fr_fr: Flexographie
pl_pl: Fleksograficzny

source: imperial
fr_fr: impérial

source: Lateral
de_de: Seitlich
fr_fr: Latéral
it_it: Laterale
nl_nl: Lateraal
pl_pl: Poprzeczne

source: Material
fr_fr: Matériel
it_it: Materiale
nl_nl: Materiaal
pl_pl: Materiał

source: Motor
fr_fr: Moteur
it_it: Motore
pl_pl: Silnik

source: NIP
de_de: NIP (BAHNJUSTIEREINHEIT)
fr_fr: PINCEMENT
pl_pl: DOCISK
ro_ro: GHIARĂ

source: Ref
fr_fr: Réf.
it_it: Rif

source: Software
fr_fr: Logiciel
pl_pl: Oprogramowanie

source: WLAN
fr_fr: R-LAN

source: Calib
de_de: Kalib
fr_fr: Étalonnage

source: Calib /1
de_de: Kalib /1
fr_fr: Étalonnage / 1

source: Calib /2
de_de: Kalib /2
fr_fr: Étalonnage / 2

source: Calib /3
de_de: Kalib /3
fr_fr: Étalonnage / 3

source: Calib /4
de_de: Kalib /4
fr_fr: Étalonnage / 4

source: Cap /1
de_de: Kappe /1
fr_fr: Bouchon /1

source: Cap /2
de_de: Kappe /2
fr_fr: Bouchon /2

source: Cap /3
de_de: Kappe /3
fr_fr: Bouchon /3

source: Cap /4
de_de: Kappe /4
fr_fr: Bouchon /4

source: Cap /5
de_de: Kappe /5
fr_fr: Bouchon /5

source: Cap /6
de_de: Kappe /6
fr_fr: Bouchon /6

source: Docs
de_de: Dokumente
fr_fr: Documents

source: gui
fr_fr: interface graphique

source: plc
de_de: SPS
fr_fr: API

source: Primer 1 (PRI1)
fr_fr: Primaire 1 (PRI1)

source: Primer 2 (PRI2)
fr_fr: Primaire 2 (PRI2)

source: Vac
fr_fr: Vide

source: Vac /1
fr_fr: Vide /1

source: Vac /10
fr_fr: Vide /10

source: Vac /11
fr_fr: Vide /11

source: Vac /12
fr_fr: Vide /12

source: Vac /13
fr_fr: Vide /13

source: Vac /14
fr_fr: Vide /14

source: Vac /2
fr_fr: Vide /2

source: Vac /3
fr_fr: Vide /3

source: Vac /4
fr_fr: Vide /4

source: Vac /5
fr_fr: Vide /5

source: Vac /6
fr_fr: Vide /6

source: Vac /7
fr_fr: Vide /7

source: Vac /8
fr_fr: Vide /8

source: Vac /9
fr_fr: Vide /9

source: Manual
de_de: Manuell
fr_fr: Manuel

source: ERROR 23:
de_de: FEHLER 23:
fr_fr: ERREUR 23 :

source: ERROR 24:
de_de: FEHLER 24:
fr_fr: ERREUR 24 :

source: ERROR 25:
de_de: FEHLER 25:
fr_fr: ERREUR 25 :

source: ERROR 26:
de_de: FEHLER 26:
fr_fr: ERREUR 26 :

source: ERROR 27:
de_de: FEHLER 27:
fr_fr: ERREUR 27 :

source: ERROR 28:
de_de: FEHLER 28:
fr_fr: ERREUR 28 :

source: ERROR 29:
de_de: FEHLER 29:
fr_fr: ERREUR 29 :

source: ERROR 30:
de_de: FEHLER 30:
fr_fr: ERREUR 30 :

source: ERROR 31:
de_de: FEHLER 31:
fr_fr: ERREUR 31 :

source: ERROR 32:
de_de: FEHLER 32:
fr_fr: ERREUR 32 :

source: Putty
de_de: Kitt
nl_nl: Stopverf

source: Robot
de_de: Roboter

source: total
de_de: Gesamt
it_it: totale
nl_nl: totaal
pl_pl: łącznie

source: Variable
de_de: Variabel

source: Corona
pl_pl: Moduł koronowy
ro_ro: Coroană
