Repository: marcel-galliker/Mouvent-PrintEngine
Catalog: mvt_digiprint_gui/Resources/Language/Resources.*.resx
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pl_pl, ro_ro

source: About RX-DigiPrint
de_de: Über RX-DigiPrint
es_es: Acerca de RX-DigiPrint
fr_fr: À propos de RX-DigiPrint
it_it: Informazioni su RX-DigiPrint
nl_nl: Over RX-DigiPrint
pl_pl: Informacje o RX-DigiPrint
ro_ro: Despre RX-DigiPrint

source: Active
de_de: Aktiv
es_es: Activar
fr_fr: Actif

source: Add file to print
de_de: Zum Drucken Datei hinzufügen
es_es: Añadir archivo para imprimir
fr_fr: Ajouter un fichier à imprimer
it_it: Aggiungi file da stampare
nl_nl: Bestand toevoegen om af te drukken
pl_pl: Dodaj plik do druku
ro_ro: Adăugați fișier de printat

source: Adjust
de_de: Einstellen
es_es: Ajustar
fr_fr: Ajuster
it_it: Regola
nl_nl: Aanpassen
pl_pl: Dostosuj
ro_ro: Reglaţi

source: Adjustment
de_de: Einstellung
es_es: Ajuste
fr_fr: Ajustement
it_it: Regolazione
nl_nl: Aanpassing
pl_pl: Dostosowywanie
ro_ro: Reglare

source: Adjust Position
de_de: Einstellposition
es_es: Ajustar posición
fr_fr: Ajuster position
it_it: Regola posizione
nl_nl: Aanpassen positie
pl_pl: Dostosuj pozycję
ro_ro: Reglați poziția

source: Air Valve
de_de: Luftventil
es_es: Válvula de aire
fr_fr: Vanne d'air
it_it: Valvola aria
nl_nl: Luchtklep
pl_pl: Zawór powietrza
ro_ro: Supapă de aer

source: Alignment
de_de: Ausrichtung
es_es: Alineación
fr_fr: Alignement
it_it: Allineamento
nl_nl: Uitlijning
pl_pl: Wyrównanie
ro_ro: Aliniere

source: Alignment Settings
de_de: Ausrichtungseinstellungen
es_es: Configuración de alineación
fr_fr: Paramètres d'alignement
it_it: Impostazioni allineamento
nl_nl: Uitlijningsinstellingen
pl_pl: Ustawienia wyrównania
ro_ro: Setări aliniere

source: ALL
de_de: ALLE
es_es: TODO
fr_fr: TOUS
it_it: TUTTE
nl_nl: ALLE
pl_pl: WSZYSTKO
ro_ro: TOATE LEMENTELE

# JetNumberAlreadyListed
source: Jet number {0} already listed!
de_de: Strahlnummer {0} schon aufgeführt!
es_es: El número de chorro {0} ya está en la lista (!)
fr_fr: Nombre de jets {0} déjà répertoriés !

source: Angle
de_de: Winkel
es_es: Ángulo
it_it: Angolo
nl_nl: Hoek
pl_pl: Kąt
ro_ro: Unghi

source: Angle / Stitch Correction
de_de: Winkel-/Stitch-Korrektur
es_es: Corrección de ángulos y puntos
fr_fr: Correction angle / stitch
it_it: Correzione dell'angolo / del punto
nl_nl: Hoek / stitchcorrectie
pl_pl: Korekta kąta/Stitch
ro_ro: Unghi/Corecție îmbinare

source: Angle [stp]
de_de: Winkel [Stp]
es_es: Ángulo [stp]
it_it: Angolo [stp]
nl_nl: Hoek [stp]
pl_pl: Kąt [stp]
ro_ro: Unghi [stp]

source: Antifoam
de_de: Antischaum
es_es: Antiespuma
fr_fr: Antimousse

# AtLeastOneInkSupplyIsFlushed
source: At least one ink supply is flushed. Please purge first.
de_de: Mindestens ein Tintenvorrat wird gespült. Bitte reinigen Sie zuerst.
es_es: Al menos un suministro de tinta se descarga. Por favor, purgue antes.
fr_fr: Au moins une réserve d’encre est vide. Veuillez purge d’abord.

source: Auto-generate message
de_de: Nachricht automatisch generieren
es_es: Generación automática de mensajes
fr_fr: Génération automatique du message
it_it: Messaggio autogenerato
nl_nl: Automatisch gegenereerd bericht
pl_pl: Komunikat generowany automatycznie
ro_ro: Generare automată mesaj

source: Back Left
de_de: Rückseite links
es_es: Parte posterior izquierda
fr_fr: Arrière gauche
it_it: Dietro sinistra
nl_nl: Links achter
pl_pl: Lewy tył
ro_ro: Stânga spate

source: Back Right
de_de: Rückseite rechts
es_es: Parte posterior derecha
fr_fr: Arrière droit
it_it: Dietro destra
nl_nl: Rechts achter
pl_pl: Prawy tył
ro_ro: Dreapta spate

source: Barcode Scanner
es_es: Lector de código de barras
fr_fr: Lecteur de code-barre
it_it: Scanner codice a barre
pl_pl: Skaner kodów kreskowych
ro_ro: Scaner coduri de bare

source: Basket
de_de: Korb
es_es: Cesta
fr_fr: Panier
it_it: Cestino
nl_nl: Mandje
pl_pl: Koszyk
ro_ro: Coş

source: Belt Heater Max
de_de: Bandheizung Max
es_es: Calentador de cinta máx.
fr_fr: Chauffe-bande max.

# BeltStep
source: Belt Step [µm]
de_de: Bandschritt [µm]
es_es: Paso de la cinta [µm]
fr_fr: Distance d'avancée de la bande [µm]
it_it: Passo del nastro [µm]
nl_nl: Riem stap [µm]
pl_pl: Skok taśmy [µm]
ro_ro: Pas centură [µm]

source: Bleed Valve
de_de: Entlüftungsventil
es_es: Válvula de sangrado
fr_fr: Vanne de purge
it_it: Valvola di sfiato
nl_nl: Ontluchtingsklep
pl_pl: Zawór upustowy
ro_ro: Supapă de aerisire

source: Buffer in Start
de_de: Puffer in Startposition
es_es: Búfer en posición de inicio
fr_fr: Tampon en position de démarrage
it_it: Buffer in avvio
pl_pl: Bufor w poz. startowej
ro_ro: Buffer în mod start

source: Build
es_es: Compilación
fr_fr: Construire
pl_pl: Kompilacja
ro_ro: Compilați

source: Buses Down
de_de: Sammelleitungen unten
es_es: Buses abajo
fr_fr: Bus bas

source: Buses Up
de_de: Sammelleitungen oben
es_es: Buses arriba
fr_fr: Bus haut

source: Button
de_de: Schaltfläche
es_es: Botón
fr_fr: Bouton
it_it: Pulsante
nl_nl: Knop
pl_pl: Przycisk
ro_ro: Buton

source: Calibrate
de_de: Kalibrieren
es_es: Calibrar
fr_fr: Calibrer
it_it: Calibrazione
nl_nl: Kalibreer
pl_pl: Kalibruj
ro_ro: Calibrați

source: Calibrate Diameter
de_de: Durchmesser kalibrieren
es_es: Calibrar diámetro
fr_fr: Calibrer diamètre
it_it: Diametro calibrazione
nl_nl: Kalibreer diameter
pl_pl: Kalibruj średnicę
ro_ro: Calibrați diametrul

source: Calibrate Tension
de_de: Spannung kalibrieren
es_es: Calibrar tensión
fr_fr: Calibrer tension
it_it: Tensione calibrazione
nl_nl: Kalibreer spanning
pl_pl: Kalibruj napięcie
ro_ro: Calibrați tensiunea

source: Calibration
de_de: Kalibrierung
es_es: Calibración
fr_fr: Calibrage
it_it: Calibrazione
nl_nl: Kalibratie
pl_pl: Kalibracja
ro_ro: Calibrare

source: Cancel
de_de: Löschen
es_es: Cancelar
fr_fr: Annuler
it_it: Annulla
nl_nl: Annuleren
pl_pl: Anuluj
ro_ro: Anulați

source: Cap
de_de: Kappe
es_es: Límite
fr_fr: Bouchon
it_it: Tappo
pl_pl: Osłona
ro_ro: Dispozitiv protecție

source: Capping Height
de_de: Capping-Höhe
es_es: Altura límite
fr_fr: Hauteur de recouvrement
it_it: Altezza tappatura
nl_nl: Cappinghoogte
pl_pl: Wysokość zakładania osłony
ro_ro: Înălțime sistem de protecție

source: Carriage CAP
de_de: Schlitten-CAP
es_es: Carro CAP
fr_fr: Chariot CAP
it_it: Tappo carrello
nl_nl: Verplaatsing naar CAP
pl_pl: Ustaw w poz. zakładania osłony
ro_ro: Sanie CAP

source: Carriage REF
de_de: Schlitten-REF
es_es: Carro REF
fr_fr: Chariot REF
it_it: Rif carrello
nl_nl: Verplaatsing naar REF
pl_pl: Ustaw w poz. referencyjnej
ro_ro: Sanie REF

source: Change Computer Name
de_de: Computername ändern
es_es: Cambiar nombre del ordenador
fr_fr: Modifier nom de l'ordinateur
it_it: Cambia nome computer
nl_nl: Wijzig computernaam
pl_pl: Zmień nazwę komputera
ro_ro: Modificați numele computerului

source: Change Name to
de_de: Name ändern in
es_es: Cambiar nombre a
fr_fr: Modifier le nom en
it_it: Cambia nome in
nl_nl: Wijzig naam in
pl_pl: Zmień nazwę na
ro_ro: Modificați numele în

source: Check
de_de: Prüfen
es_es: Comprobar
fr_fr: Vérifier
it_it: Verifica
nl_nl: Controleer
pl_pl: Sprawdź
ro_ro: Verificați

source: Child
de_de: Kind
es_es: Niño
fr_fr: Enfant
it_it: Figlio
nl_nl: Kind
pl_pl: Podrzędny
ro_ro: Răcire

source: Chiller
de_de: Kühler
es_es: Enfriador
fr_fr: Refroidisseur
it_it: Raffreddatore
nl_nl: Koelmachine
ro_ro: Dispozitiv răcire

source: Chiller not running
de_de: Kühler läuft nicht
es_es: El enfriador no funciona
fr_fr: Le refroidisseur ne fonctionne pas
it_it: Raffreddatore non funzionante
nl_nl: Koelmachine draait niet
pl_pl: Chiller nie pracuje
ro_ro: Dispozitivul răcire nu funcționează

source: Cleaner
de_de: Reiniger
es_es: Limpiador
fr_fr: Nettoyeur

source: Cleaning
de_de: Reinigung
es_es: Limpieza
fr_fr: Nettoyage
it_it: Pulizia
nl_nl: Reiniging
pl_pl: Czyszczenie
ro_ro: Curățare

source: Clear Error
de_de: Fehler löschen
es_es: Borrar error
fr_fr: Effacez l’erreur

source: Cluster 1
es_es: Clúster 1
fr_fr: Groupe 1
pl_pl: Klaster 1
ro_ro: Grup 1

source: Coating dryer
de_de: Beschichtungstrockner
es_es: Secador de revestimiento
fr_fr: Séchoir pour couchage
it_it: Essiccatore di rivestimento
nl_nl: Droger voor coating
pl_pl: Suszarka powlekająca
ro_ro: Uscător acoperire

source: Coating Position
de_de: Beschichtungsposition
es_es: Posición del revestimiento
fr_fr: Position du couchage
it_it: Posizione rivestimento
nl_nl: Positie voor coating
pl_pl: Pozycja modułu powlekania
ro_ro: Poziție acoperire

source: Coating Tension
de_de: Beschichtungsspannung
es_es: Tensión del revestimiento
fr_fr: Tension du couchage
it_it: Tensione rivestimento
nl_nl: Spanning voor coating
pl_pl: Napięcie modułu powlekania
ro_ro: Tensiune acoperire

source: Coating Unit
de_de: Beschichtungseinheit
es_es: Unidad del revestimiento
fr_fr: Unité de revêtement
it_it: Unità rivestimento
nl_nl: Eenheid voor coating
pl_pl: Powlekarka
ro_ro: Unitate acoperire

source: Code
es_es: Código
it_it: Codice
pl_pl: Kod
ro_ro: Cod

source: Collate
de_de: Sortieren
es_es: Intercalar
fr_fr: Assembler
it_it: Fascicola
nl_nl: Sorteren
pl_pl: Sortuj
ro_ro: Colaj

source: Colors
de_de: Farben
es_es: Colores
fr_fr: Couleurs
it_it: Colori
nl_nl: Kleuren
pl_pl: Kolory
ro_ro: Culori

source: Commands
de_de: Befehle
es_es: Comandos
fr_fr: Commandes
it_it: Comandi
nl_nl: Opdrachten
pl_pl: Polecenia
ro_ro: Comenzi

source: Conditioner: Pressure Inlet
de_de: Conditioner: Druckeinlass
es_es: Acondicionador: Entrada de presión
fr_fr: Conditionneur : Pression d'admission
it_it: Condizionatore: Entrata pressione
nl_nl: Conditioner: Drukinlaat
pl_pl: Kondycjoner: Ciśnienie wlotowe
ro_ro: Conditioner: Intrare de presiune

source: Conditioner: Pumps Speed
de_de: Conditioner: Pumpendrehzahl
es_es: Acondicionador: Velocidad de las bombas
fr_fr: Conditionneur : Vitesse de la pompe
it_it: Condizionatore: Velocità pompe
nl_nl: Conditioner: Pompsnelheid
pl_pl: Kondycjoner: Prędkość pomp
ro_ro: Conditioner: Viteză pompe

source: Configuration
de_de: Konfiguration
es_es: Configuración
it_it: Configurazione
nl_nl: Configuratie
pl_pl: Konfiguracja
ro_ro: Configurare

source: Connected
de_de: Verbunden
es_es: Conectado
fr_fr: Connecté
it_it: Connesso
nl_nl: Verbonden
pl_pl: Połączono
ro_ro: Element conectat

source: Consumables
de_de: Verbrauchsmaterialien
es_es: Consumibles
fr_fr: Consommables
it_it: Materiali di consumo
nl_nl: Verbruiksartikelen
pl_pl: Materiały eksploatacyjne
ro_ro: Consumabile

source: Control Mode
de_de: Bedienmodus
es_es: Modo de control
fr_fr: Mode de contrôle
it_it: Modalità Controllo
nl_nl: Controlemodus
pl_pl: Tryb sterowania
ro_ro: Mod Control

source: Copies
de_de: Kopien
es_es: Copias
it_it: Copie
nl_nl: Kopieën
pl_pl: Kopie
ro_ro: Copiere

source: Copy
de_de: Kopie
es_es: Copia
fr_fr: Copie
it_it: Copia
nl_nl: Kopie
pl_pl: Kopiuj
ro_ro: Copiați

source: Could not load button style.
de_de: Der Tastenstil konnte nicht geladen werden.
es_es: No se ha podido cargar el estilo del botón.
fr_fr: Impossible de charger le style de bouton.

source: Cover Open
de_de: Abdeckung offen
es_es: Cubierta abierta
fr_fr: Couvercle ouvert
it_it: Coperchio aperto
nl_nl: Deksel open
pl_pl: Pokrywa otwarta
ro_ro: Deschideți carterul

source: Curing
de_de: Curing (Härten)
es_es: Curación
fr_fr: Polymérisation

source: Curing Lamp
de_de: Aushärtungslampe
es_es: Lámpara de curado
fr_fr: Lampe à polymériser
it_it: Lampada essiccazione
nl_nl: Uithardende Lamp
pl_pl: Lampa utwardzająca
ro_ro: Lampă de uscare

source: Curing Lamp OK
de_de: Aushärtungslampe OK
es_es: Lámpara de curado OK
fr_fr: Lampe à polymériser OK

source: Curing Passes
de_de: Aushärtungsdurchgänge
es_es: Pases de curado
fr_fr: Passages de polymérisation
it_it: Passate essiccazione
nl_nl: Uithardende Pasjes
pl_pl: Przebiegi utwardzające
ro_ro: Deplasări de uscare

source: Cut Dist
de_de: Schnittabstand
es_es: Corte Dist
fr_fr: Distance de découpe

source: Cutter Nip Standstill
de_de: Schneideeinheit-Nip-Stillstand
es_es: Parada de NIP del cortador
fr_fr: Arrêt du pincement du massicot
it_it: Nip cutter fermo
nl_nl: Cutter Nip stilstand
pl_pl: Postój docisku krajarki
ro_ro: Imobilizare ghiară cutter

source: Cutting
de_de: Schneiden
es_es: Cortando
fr_fr: Découpage
it_it: Taglio
nl_nl: Snijden
pl_pl: Cięcie
ro_ro: Tăiere

source: Data
de_de: Daten
es_es: Datos
fr_fr: Données
it_it: Dati
nl_nl: Gegevens
pl_pl: Dane
ro_ro: Date

source: Data Ready
de_de: Daten bereit
es_es: Datos listos
fr_fr: Données prêtes
it_it: Dati pronti
nl_nl: Gegevens klaar
pl_pl: Dane gotowe
ro_ro: Date disponibile

source: Date
de_de: Datum
es_es: Fecha
it_it: Data
nl_nl: Datum
pl_pl: Data
ro_ro: Coordonate de timp

source: Delete
de_de: Löschen
es_es: Eliminar
fr_fr: Supprimer

# ConfirmDeleteMaterial
source: Delete Material >>{0}<<?
de_de: Material löschen >>{0}<<?
es_es: Eliminar material >>{0}<<?
fr_fr: Supprimer le matériel >>{0}<< ?

source: Delete the Items
de_de: Artikel löschen
es_es: Eliminar los elementos
fr_fr: Supprimez les articles

# ConfirmDelete
source: Delete {0}?
de_de: Löschen {0}?
es_es: ¿Eliminar {0}?
fr_fr: Le supprimer {0} ?

source: Density
de_de: Dichte
es_es: Densidad
fr_fr: Densité
it_it: Densità
nl_nl: Dichtheid
pl_pl: Gęstość
ro_ro: Densitate

source: Density and Jet Compensation
de_de: Dichte- und Strahlkompensation
es_es: Densidad y compensación del chorro
fr_fr: Densité et compensation des jets
it_it: Densità e compensazione getto
nl_nl: Dichtheid en straalcompensatie
pl_pl: Kompensacja gęstości i strumienia
ro_ro: Densitate şi Compensare Jet

# DensityJetCompensation
source: Density and Jet Compensation
de_de: Dichte- und Strahlkompensation
es_es: Densidad y compensación del chorro
fr_fr: Densité et compensation des jets
it_it: Densità e compensazione getto
nl_nl: Dichtheid en straalcompensatie
pl_pl: Kompensacja gęstości i strumienia
ro_ro: Densitate şi Compensare Jet

source: Description
de_de: Beschreibung
es_es: Descripción
it_it: Descrizione
nl_nl: Beschrijving
pl_pl: Opis
ro_ro: Descriere

source: Device
de_de: Gerät
es_es: Dispositivo
fr_fr: Dispositif
it_it: Dispositivo
nl_nl: Apparaat
pl_pl: Urządzenie
ro_ro: Dispozitiv

source: Diameter
de_de: Durchmesser
es_es: Diámetro
fr_fr: Diamètre

source: Diameter Offset
de_de: Durchmesser-Offset
es_es: Compensación de diámetro
fr_fr: Correction de diamètre
it_it: Offset diametro
pl_pl: Offset średnicy
ro_ro: Offset diametru

source: Diameter RW-L
de_de: Durchmesser RW-L
es_es: Diámetro RW-L
fr_fr: Diamètre RW-L

source: Diameter RW-R
de_de: Durchmesser RW-R
es_es: Diámetro RW-R
fr_fr: Diamètre RW-R

source: Diameter UW-L
de_de: Durchmesser UW-L
es_es: Diámetro UW-L
fr_fr: Diamètre UW-L

source: Diameter UW-R
de_de: Durchmesser UW-R
es_es: Diámetro UW-R
fr_fr: Diamètre UW-R

source: Die Cut
de_de: Gestanzt
es_es: Troquelado
fr_fr: Découpe à l'emporte-pièce
it_it: Fustella
pl_pl: Wykrojnik
ro_ro: Decupare

source: Die Cutter
de_de: Stanzung
es_es: Troquelado
fr_fr: Emporte-pièce

source: Die Nip Standstill
de_de: Stanzen-Nip-Stillstand
es_es: Parada de NIP de troquelado
fr_fr: Arrêt du pincement de la matrice
it_it: Punzone fermo
nl_nl: Die Nip stilstand
pl_pl: Postój docisku wykrojnika
ro_ro: Imobilizare ghiară decupare

source: Die Nip Tension
de_de: Stanzen-Nip-Stillstand
es_es: Tensión NIP de troquelado
fr_fr: Tension du pincement de la matrice
it_it: Tensione punzone
nl_nl: Die Nip Spanning
pl_pl: Napięcie docisku wykrojnika
ro_ro: Tensiune ghiară decupare

source: Directory
de_de: Verzeichnis
es_es: Directorio
fr_fr: Répertoire
pl_pl: Katalog
ro_ro: Fișier director

source: Disconnect
de_de: Trennung
es_es: Desconectar
fr_fr: Débranchez

source: Displayed
de_de: Angezeigt
es_es: Visualizado
fr_fr: Affiché
it_it: Visualizzato
nl_nl: Weergegeven
pl_pl: Wyświetlono
ro_ro: Afișat (ă)

source: Distance
de_de: Abstand
es_es: Distancia
it_it: Distanza
nl_nl: Afstand
pl_pl: Odległość
ro_ro: Distanţă

source: Dist to Stop
de_de: Entfernung zum Stopp
es_es: Dist. hacia parada
fr_fr: Distance de l’arrêt

# DistVerso
source: Dist Verso [mm]
de_de: Abst. Verso [mm]
es_es: Dist. reverso [mm]
it_it: Verso Dist [mm]
pl_pl: Odległość Verso [mm]

source: Done
de_de: Erledigt
es_es: Listo
fr_fr: Fait
it_it: Fine
nl_nl: Gedaan
pl_pl: Gotowe
ro_ro: Operațiune finalizată

source: Do you want to reset all values?
de_de: Möchten Sie alle Werte zurücksetzen?
es_es: ¿Desea restablecer todos los valores?
fr_fr: Voulez-vous réinitialiser toutes les valeurs ?

source: DRIP PANS
de_de: AUFFANGSCHALEN
es_es: BANDEJAS PARA GOTEO
fr_fr: BACS COLLECTEURS
it_it: BACINELLE
pl_pl: TACE OCIEKOWE
ro_ro: PLATOURI SCURGERE

# DripPansBelowTheClusters
source: Drip Pans below the clusters. Move it out before printing
de_de: Auffangschalen unter den Clustern. Vor dem Drucken ausfahren
es_es: Bandejas de goteo debajo de los racimos. Moverlo antes de imprimir.
fr_fr: Bacs collecteurs sous les groupes. Déplacez-le avant l’impression

source: Drop Size
de_de: Tropfengröße
es_es: Tamaño de la gota
fr_fr: Taille de goutte
it_it: Dimensione goccia
nl_nl: Druppelgrootte
pl_pl: Wielkość kropel
ro_ro: Dimensiune Picătură

source: Dryer
de_de: Trockner
es_es: Secador
fr_fr: Séchoir
it_it: Essiccatore
nl_nl: Droger
pl_pl: Suszarka
ro_ro: Uscător

source: Dryer Temp
de_de: Trocknertemperatur
es_es: Secador de temp.
fr_fr: Température du séchoir

source: Dutch
de_de: Niederländisch
es_es: Holandés
fr_fr: Néerlandais

source: Empty
de_de: Leeren
es_es: Vaciar
fr_fr: Vider
it_it: Vuota
nl_nl: Legen
pl_pl: Opróżnij
ro_ro: Gol (goală)

source: Empty 2min
de_de: Leeren 2 min.
es_es: Vaciar 2 min
fr_fr: Vider 2 min
it_it: Vuota 2min
nl_nl: Legen 2 min
pl_pl: Opróżnij w 2 min
ro_ro: Gol (goală) 2 min

source: Encoder
es_es: Codificador
fr_fr: Codeur
it_it: Encoder [inc/m]
nl_nl: Encoder [inc/m]
pl_pl: Enkoder [przyrost/m]
ro_ro: Codificator [inc/m]

source: Encoder Adj
de_de: Encodereinstellung
es_es: Adj. codificador
fr_fr: Ajustement du codeur

source: Encoder Compensation
de_de: Encoder-Kompensation
es_es: Compensación del codificador
fr_fr: Compensation du codeur

source: Encoders Type
de_de: Encodertyp
es_es: Tipo de codificadores
fr_fr: Type de codeurs
it_it: Tipo encoder
pl_pl: Typ enkodera
ro_ro: Tip de codificatoare

# EncoderVerso
source: Encoder Verso [inc/m]
de_de: Encoder-Verso [Inkr./m]
es_es: Anverso del codificador [incre./m]
fr_fr: Codeur verso [incr./m]
it_it: Verso Encoder [inc/m]
pl_pl: Enkoder Verso [przyrost/m]
ro_ro: Verso Codificator [inc/m]

source: End
de_de: Ende
es_es: Fin
fr_fr: Fin
it_it: Fine
nl_nl: Einde
pl_pl: Koniec
ro_ro: Final

source: English
de_de: Englisch
es_es: Inglés
fr_fr: Anglais
it_it: Inglese
nl_nl: Engels
pl_pl: Angielski
ro_ro: Limba engleză

source: Error No
de_de: Fehler-Nr.
es_es: N.º error
fr_fr: Erreur n°
it_it: Errore n.
nl_nl: Aantal fouten
pl_pl: Nr błędu
ro_ro: Eroare nr.:

source: Errors
de_de: Fehler
es_es: Errores
fr_fr: Erreurs
it_it: Errori
nl_nl: Fouten
pl_pl: Błędy
ro_ro: Erori

source: Events
de_de: Ereignisse
es_es: Eventos
fr_fr: Événements
it_it: Eventi
nl_nl: Evenementen
pl_pl: Zdarzenia
ro_ro: Evenimente

# ConfirmExecute
source: Execute {0} ?
de_de: Ausführen {0}?
es_es: ¿Ejecutar {0}?
fr_fr: Exécuter {0} ?

source: Exhaust
de_de: Auslass
es_es: Escape
fr_fr: Échappement
it_it: Scarico
nl_nl: Uitlaat
pl_pl: Wylot
ro_ro: Evacuare

source: Exhaust Down
de_de: Auslass unten
es_es: Escapar hacia abajo
fr_fr: Échappement bas

source: Exhaust Up
de_de: Auslass oben
es_es: Escapar hacia arriba
fr_fr: Échappement haut

source: Fabric Position
de_de: Bespannungsposition
es_es: Posición del tejido
fr_fr: Position du tissu

source: Factory Network
de_de: Werksnetzwerk
es_es: Red de fábrica
fr_fr: Réseau d'usine
it_it: Rete di fabbrica
nl_nl: Fabrieksnetwerk
pl_pl: Sieć zakładowa
ro_ro: Rețea uzină

# FailedToImportValues
source: Failed to import values, check file format. Error Message:
de_de: Der Import von Werten ist gescheitert, prüfen Sie das Dateiformat. Fehlermeldung:
es_es: Fallo en la importación de valores, compruebe el formato del archivo. Mensaje de error:
fr_fr: Échec de l’importation des valeurs, vérifiez le format du fichier. Message d’erreur :

source: Family
de_de: Familie
es_es: Familia
fr_fr: Famille
it_it: Famiglia
nl_nl: Familie
pl_pl: Rodzina
ro_ro: Familie

source: File
de_de: Datei
es_es: Archivo
fr_fr: Fichier
nl_nl: Bestand
pl_pl: Plik
ro_ro: Fișier

source: Fill
de_de: Füllen
es_es: Llenar
fr_fr: Remplir
it_it: Riempi
nl_nl: Vullen
pl_pl: Napełnij
ro_ro: Umpleți

source: Fill 5sec
de_de: Füllen 5 s
es_es: Llenar 5 s
fr_fr: Remplir 5 sec
it_it: Riempi 5sec
nl_nl: Vullen 5sec
pl_pl: Napełnij w 5 s
ro_ro: Umpleți 5sec

source: Finisher
es_es: Dispositivo de acabado
fr_fr: Finisseur
nl_nl: Afwerkeenheid
pl_pl: Finiszer
ro_ro: Finisor

source: Firepulse Voltage
de_de: Firepulse-Spannung
es_es: Tensión de pulsos de encendido
fr_fr: Tension de l’impulsion de démarrage
it_it: Tensione impulso accensione
nl_nl: Voltage afvuurpuls
pl_pl: Napięcie impulsu aktywacyjnego
ro_ro: Tensiune firepulse

source: Flexo Dryer
de_de: Flexo-Trockner
es_es: Secador Flexo
fr_fr: Séchoir flexo
it_it: Essiccatore Flexo
nl_nl: Flexodroger
pl_pl: Suszarka fleksograficzna
ro_ro: Uscător flexo

source: Flexo Ready
de_de: Flexo bereit
es_es: Flexo listo
fr_fr: Flexo prêt
it_it: Flexo pronto
nl_nl: Flexo klaar
pl_pl: Moduł fleksograficzny gotowy
ro_ro: Flexo disponibil

source: Flexo Tension
de_de: Flexo-Spannung
es_es: Tensión de Flexo
fr_fr: Tension flexo
it_it: Tensione Flexo
nl_nl: Flexo Spanning
pl_pl: Napięcie modułu fleksograficznego
ro_ro: Tensiune flexo

source: Flexo Unit
de_de: Flexo-Einheit
es_es: Unidad de Flexo
fr_fr: Unité flexo
it_it: Unità Flexo
nl_nl: Flexo Eenheid
pl_pl: Moduł fleksograficzny
ro_ro: Unitate flexo

# FlightTime
source: FlightTime [mm]
es_es: Tiempo de vuelo [mm]
fr_fr: Temps de vol [mm]
it_it: TempoTrasferimento [mm]
nl_nl: Spuittijd [mm]
pl_pl: Czas przelotu [mm]

source: Flow Factor
de_de: Durchflussfaktor
es_es: Factor Flujo
fr_fr: Facteur de débit
it_it: Fattore flusso
nl_nl: Stroomfactor
pl_pl: Współczynnik przepływu
ro_ro: Factor de debit

source: Flush
de_de: Spülen
es_es: Lavado
fr_fr: Rincer
it_it: Lavaggio
nl_nl: Spoel
pl_pl: Przepłucz
ro_ro: Evacuare

source: FLUSHED
de_de: GESPÜLT
es_es: LAVADO
fr_fr: Rincé
it_it: LAVATO
nl_nl: GESPOELD
pl_pl: PRZEPŁUKANO
ro_ro: EVACUARE

source: Flushing
de_de: Spülen
es_es: Lavar
fr_fr: Rinçage
it_it: Lavaggio
nl_nl: Spoelen
pl_pl: Płukanie
ro_ro: Evacuare în curs

source: Font Size
de_de: Schriftgröße
es_es: Tamaño de fuente
fr_fr: Taille de police
it_it: Dimensione carattere
nl_nl: Tekengrootte
pl_pl: Rozmiar czcionki
ro_ro: Dimensiune Font

source: French
de_de: Französisch
es_es: Francés
fr_fr: Français
it_it: Francese
nl_nl: Frans
pl_pl: Francuski
ro_ro: Limba franceză

source: From
de_de: Von
es_es: De
fr_fr: De
it_it: Da
nl_nl: Van
pl_pl: Od
ro_ro: De la

source: Front Left
de_de: Vorderseite links
es_es: Parte frontal izquierda
fr_fr: Avant gauche
it_it: Anteriore sinistra
nl_nl: Links voor
pl_pl: Lewy przód
ro_ro: Recto stânga

source: Front Right
de_de: Vorderseite rechts
es_es: Parte frontal derecha
fr_fr: Avant droite
it_it: Anteriore destra
nl_nl: Rechts voor
pl_pl: Prawy przód
ro_ro: Recto Dreapta

source: German
de_de: Deutsch
es_es: Alemán
fr_fr: Allemand

source: Gloss
de_de: Glanz
es_es: Brillo
fr_fr: Brillance
it_it: Lucido
nl_nl: Glans
pl_pl: Połysk
ro_ro: Luciu

source: Glue Speed
de_de: Frischkleber
es_es: Velocidad del pegamento
fr_fr: Vitesse de la colle

source: Gluing
de_de: Kleben
es_es: Encolado
fr_fr: Collage
it_it: Incollaggio
nl_nl: Lijmen
pl_pl: Klejenie
ro_ro: Lipire

source: Good quality
de_de: Gute Qualität
es_es: Buena calidad
fr_fr: Bonne qualité

source: Head Adjustment
de_de: Kopfeinstellung
es_es: Ajuste del cabezal
fr_fr: Ajustement de la tête
it_it: Regolazione testine
nl_nl: Aanpassing kop
pl_pl: Regulacja głowicy
ro_ro: Reglare cap
