Repository: marcel-galliker/Mouvent-PrintEngine
Catalog: mvt_digiprint_gui/Resources/Language/Resources.*.resx
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pl_pl, ro_ro

source: Queue
de_de: Warteschlange
es_es: Cola
fr_fr: File d'attente
it_it: Coda
nl_nl: Wachtrij
pl_pl: Kolejka
ro_ro: Coadă

source: Ready to Print
de_de: Druckbereit
es_es: Listo para imprimir
fr_fr: Prêt à imprimer

source: Recto
de_de: Vorderseite
es_es: Anverso

source: Ref Buffer
de_de: Referenzpuffer
es_es: Ref. de la rebobinadora
fr_fr: Tampon de référence

source: Reference
de_de: Referenz
es_es: Referencia
fr_fr: Référence
it_it: Riferimento
nl_nl: Referentie
pl_pl: Odniesienie
ro_ro: Referința

source: Reference Done
de_de: Referenz Erledigt
es_es: Referencia lista
fr_fr: Référence faite
it_it: Riferimento fatto
nl_nl: Referentie Gedaan
pl_pl: Odniesienie gotowe
ro_ro: Referință finalizată

source: Reference Enable
de_de: Referenzfreigabe
es_es: Referencia permitida
fr_fr: Référence possible

source: Ref Height
de_de: Ref.-Höhe
es_es: Altura de referencia
fr_fr: Hauteur de réf.
it_it: Altezza rif
nl_nl: Ref Hoogte
pl_pl: Wysokość ref.
ro_ro: Înălțime Ref

source: Ref Height (back)
de_de: Ref.-Höhe (Rückseite)
es_es: Altura de referencia (trasera)
fr_fr: Hauteur de réf. (arrière)
it_it: Altezza rif (posteriore)
nl_nl: Ref Hoogte (achter)
pl_pl: Wysokość ref. (tył)
ro_ro: Înălțime Ref (recto)

source: Ref Height (front)
de_de: Ref.-Höhe (Vorderseite)
es_es: Altura de referencia (frontal)
fr_fr: Hauteur de réf. (avant)
it_it: Altezza rif (anteriore)
nl_nl: Ref Hoogte (voor)
pl_pl: Wysokość ref. (przód)
ro_ro: Înălțime Ref (verso)

source: Refreshing
de_de: Aktualisierung
es_es: Actualizar
fr_fr: Rafraîchissement
it_it: Aggiorna
nl_nl: Vernieuwen
pl_pl: Odświeżanie
ro_ro: Actualizare

source: Ref Robot
de_de: Ref.-Roboter
es_es: Robot de referencia
fr_fr: Robot de réf.
pl_pl: Robot ref.
ro_ro: Robot Ref

source: Register
de_de: Verzeichnis
es_es: Registrar
fr_fr: Registre

source: Remove
de_de: Entfernen
es_es: Eliminar
fr_fr: Supprimez
it_it: Rimuovi
nl_nl: Verwijder
pl_pl: Usuń
ro_ro: Eliminați

source: Reset
de_de: Zurücksetzen
es_es: Restablecer
fr_fr: Réinitialiser
it_it: Ripristina
pl_pl: Resetuj
ro_ro: Resetați

source: Reset counter
de_de: Zurücksetzen des Zählers
es_es: Restablecer contador
fr_fr: Réinitialisez le compteur

source: Reset Length L
de_de: Länge L zurücksetzen
es_es: Restablecer longitud L
fr_fr: Réinitialiser longueur L
it_it: Azzera Lunghezza L
nl_nl: Reset Lengte L
pl_pl: Resetuj długość L
ro_ro: Resetare lungime L

source: Reset Length R
de_de: Länge R zurücksetzen
es_es: Restablecer longitud R
fr_fr: Réinitialiser longueur R
it_it: Azzera Lunghezza L
nl_nl: Reset Lengte R
pl_pl: Resetuj długość P
ro_ro: Resetare lungime R

source: Reset the counter of UV lamp operating hours?
de_de: Zähler der Betriebsstunden der UV-Lampe zurücksetzen?
es_es: ¿Restablecer el contador de horas de funcionamiento de la lámpara UV?
fr_fr: Réinitialiser le compteur d’heures de fonctionnement de la lampe UV ?

source: Reset Values
de_de: Werte zurücksetzen
es_es: Restablecer valores
fr_fr: Réinitialisez les valeurs

source: Restart
de_de: Neu starten
es_es: Reiniciar
fr_fr: Redémarrer

source: Restart GUI
de_de: Graphische Benutzeroberfläche neu starten
es_es: Reiniciar la interfaz gráfica de usuario
fr_fr: Redémarrer GUI
it_it: Riavvia GUI
nl_nl: Opnieuw opstarten GUI
pl_pl: Ponownie uruchom GUI
ro_ro: Reporniți GUI

source: Restarting the GUI!
de_de: Graphische Benutzeroberfläche neu starten!
es_es: Reiniciando la interfaz gráfica de usuario (!)
fr_fr: Redémarrage de l’interface graphique !

source: Restarting the MAIN!
de_de: HAUPTEINHEIT neu starten!
es_es: Reiniciando el PRINCIPAL (!)
fr_fr: Redémarrage PRINCIPAL !

source: Restart Main
de_de: Haupteinheit neu starten
es_es: Reinicio principal
fr_fr: Redémarrer Principal
it_it: Riavvia principale
nl_nl: Opnieuw opstarten Main
pl_pl: Ponownie uruchom menu główne
ro_ro: Reporniți Principal

source: Rewinder
de_de: Aufwickler
es_es: Rebobinadora
fr_fr: Enrouleur
it_it: Riavvolgitore
nl_nl: Opwikkelaar
pl_pl: Przewijarka
ro_ro: Înfășurător

source: Rewinder 1 Standstill
de_de: Stillstand, Aufwickler 1
es_es: Parada de rebobinadora 1
fr_fr: Arrêt enrouleur 1
it_it: Riavvolgitore 1 fermo
nl_nl: Opwikkelaar 1 Stilstand
pl_pl: Postój przewijarki 1
ro_ro: Blocare Înfășurător 1

source: Rewinder 1 Tension
de_de: Spannung, Aufwickler 1
es_es: Tensión de rebobinadora 1
fr_fr: Tension enrouleur 1
it_it: Riavvolgitore 1 Tensione
nl_nl: Opwikkelaar 1 Spanning
pl_pl: Napięcie przewijarki 1
ro_ro: Tensiune Înfășurător 1

source: Rewinder 2 Standstill
de_de: Stillstand, Aufwickler 2
es_es: Parada de rebobinadora 2
fr_fr: Arrêt enrouleur 2
it_it: Riavvolgitore 2 fermo
nl_nl: Opwikkelaar 2 Stilstand
pl_pl: Postój przewijarki 2
ro_ro: Blocare Înfășurător 2

source: Rewinder 2 Tension
de_de: Spannung, Aufwickler 2
es_es: Tensión de rebobinadora 2
fr_fr: Tension enrouleur 2
it_it: Riavvolgitore 2 Tensione
nl_nl: Opwikkelaar 2 Spanning
pl_pl: Napięcie przewijarki 2
ro_ro: Tensiune Înfășurător 2

# RewinderBuffer
source: Rewinder Bufffer
de_de: Aufwicklerpuffer
es_es: Búfer de la rebobinadora
fr_fr: Tampon enrouleur
it_it: Buffer riavvolgitore
nl_nl: Opwikkelaar Bufffer
pl_pl: Bufor przewijarki
ro_ro: Buffer Înfășurător

source: Rewinder Core
de_de: Aufwicklerkern
es_es: Centro de la rebobinadora
fr_fr: Noyau de l’enrouleur

source: Rewinder diameter
de_de: Aufwicklerdurchmesser
es_es: Diámetro de la rebobinadora
fr_fr: Diamètre de l’enrouleur

source: Rewinder Dist
de_de: Aufwicklerabstand
es_es: Dist. de la rebobinadora
fr_fr: Distance enrouleur

source: Rewinder Grid Standstill
de_de: Stillstand, Rewinder Grid
es_es: Parada de la rejilla de la rebobinadora
fr_fr: Arrêt Rewinder Grid
it_it: Griglia riavvolgitore fermo
nl_nl: Rewinder Grid Stilstand
pl_pl: Postój przewijarki Rewinder Grid
ro_ro: Blocare Rewinder Grid

source: Rewinder Grid Tension
de_de: Spannung, Rewinder Grid
es_es: Tensión de la rejilla de la rebobinadora
fr_fr: Tension Rewinder Grid
it_it: Tensione griglia riavvolgitore
nl_nl: Rewinder Grid Spanning
pl_pl: Napięcie przewijarki Rewinder Grid
ro_ro: Tensiune Rewinder Grid

source: Rewinder Max
de_de: Aufwickler Max
es_es: Rebobinadora máx.
fr_fr: Enrouleur max

source: Rewinder RW-L
de_de: Aufwickler RW-L
es_es: Rebobinadora RW-L
fr_fr: Enrouleur RW-L

source: Rewinder RW-R
de_de: Aufwickler RW-R
es_es: Rebobinadora RW-R
fr_fr: Enrouleur RW-R

source: Rewinder Standstill
de_de: Aufwickler-Stillstand
es_es: Parada de rebobinadora
fr_fr: Arrêt enrouleur
it_it: Riavvolgitore fermo
nl_nl: Opwikkelaar Stilstand
pl_pl: Postój przewijarki
ro_ro: Blocare înfășurător

source: Rewinder Tension
de_de: Aufwicklerspannung
es_es: Tensión de rebobinadora
fr_fr: Tension enrouleur
it_it: Tensione riavvolgitore
nl_nl: Opwikkelaar Spanning
pl_pl: Napięcie przewijarki
ro_ro: Tensiune înfășurător

source: Rewinder Ø
de_de: Aufwickler Ø
es_es: Rebobinadora Ø
fr_fr: Enrouleur Ø

source: Ripped
de_de: Gerippt
es_es: Rasterizado
fr_fr: Rastérisé
it_it: Dati estratti
pl_pl: Zgrano
ro_ro: Element rasterizat

source: Ripped Data
de_de: Gerippte Daten
es_es: Datos rasterizados
fr_fr: Données rastérisées
it_it: Dati estratti
nl_nl: Ripped gegevens
pl_pl: Zgrane dane
ro_ro: Date rasterizate

source: Robot functionality not implemented yet.
de_de: Roboterfunktionalität noch nicht implementiert.
es_es: La funcionalidad de los robots aún no está implementada.
fr_fr: La fonctionnalité robot n’est pas encore mise en œuvre.

source: Rolls Diameter
de_de: Rollendurchmesser
es_es: Diámetro de rodillos
fr_fr: Diamètre des rouleaux
it_it: Diametro del rullo
pl_pl: Średnica zwojów
ro_ro: Diametru role

source: Rolls produced
de_de: Erzeugte Rollen
es_es: Producido de rodillos
fr_fr: Rouleaux produits
it_it: Rulli prodotti
nl_nl: Rolls Geproduceerd
pl_pl: Wyprodukowane zwoje
ro_ro: Role produse

# RollNo
source: Roll {0}
de_de: Rolle {0}
es_es: Rodillo {0}
fr_fr: Lancez {0}

source: Romanian
de_de: Rumänisch
es_es: Rumano
fr_fr: Roumain

source: Rotation
de_de: Rotation (Drehung)
es_es: Rotación

source: Run
de_de: Lauf
es_es: Ejecutar
fr_fr: Exécutez

# RwTension0
source: RW Tension &amp; Ø
de_de: RW-Spannung &amp; Ø
es_es: Tensión bobinado &amp; Ø
fr_fr: Tension dérouleur &amp ; Ø
it_it: Tensione RW & Ø
nl_nl: Opw Spanning & Ø
pl_pl: Napięcie i Ø przewijarki
ro_ro: RW Tensiune & Ø

source: Save new compensation parameters?
de_de: Neue Kompensationsparameter speichern?
es_es: ¿Guardar los nuevos parámetros de compensación?
fr_fr: Enregistrer les nouveaux paramètres de compensation ?

source: Scales Calibration
de_de: Kalibrierung der Waage
es_es: Calibración de escalas
fr_fr: Calibrage échelles
it_it: Calibrazione
nl_nl: Kalibratie van weegschalen
pl_pl: Kalibracja wagi
ro_ro: Calibrare scale

source: Scan
de_de: Scannen
es_es: Escanear
fr_fr: Numériser
pl_pl: Skanuj
ro_ro: Scanare

source: Scan Check Import
de_de: Scanprüfung importieren
es_es: Escanear Comprobar Importar
fr_fr: Importation du contrôle du scan

source: Scan Mode
de_de: Scanmodus
es_es: Modo Escaneo
fr_fr: Mode de numérisation
it_it: Modo scansione
nl_nl: Scanmodus
pl_pl: Tryb skanowania
ro_ro: Mod scanare

source: Scanner Enabled
de_de: Scannerfreigabe
es_es: Escáner activado
fr_fr: Scanner activé

source: Scanner in Start
de_de: Scanner in Startposition
es_es: Escáner en inicio
fr_fr: Scanner en position de démarrage
it_it: Avvio scansione
pl_pl: Skaner w poz. startowej
ro_ro: Scaner în mod start

source: Scans
es_es: Escaneos
fr_fr: Numérisations
it_it: Scansioni
pl_pl: Skany
ro_ro: Scanează

source: Serial No
de_de: Seriennr.
es_es: Número de serie
fr_fr: Numéro de série
it_it: Numero di serie
nl_nl: Serie nr
pl_pl: Nr seryjny
ro_ro: Nr. de serie

source: SET
de_de: EINSTELLUNG
es_es: ESTABLECER
fr_fr: DÉFINISSEZ

source: Set TARA
de_de: TARA einstellen
es_es: Establecer TARA
fr_fr: Définissez la TARE

# ConfirmSetTaraFor
source: Set Tara for {0}?
de_de: TARA einstellen für {0}?
es_es: ¿Establecer tara para {0}?
fr_fr: Définir la TARE pour {0} ?

source: Settings
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
it_it: Impostazioni
nl_nl: Instellingen
pl_pl: Ustawienia
ro_ro: Setări

source: Setup
de_de: Installation
es_es: Configurar
fr_fr: Configuration

source: Setup Commands
de_de: Setup-Befehle
es_es: Comandos de Configuración
fr_fr: Commandes de configuration
it_it: Comandi impostazione
nl_nl: Instelopdrachten
pl_pl: Polecenia konfiguracji
ro_ro: Comenzi configurare

source: Shut Down
de_de: Abschaltung
es_es: Cerrar
fr_fr: Arrêtée

source: Shut Down GUI
de_de: Graphische Benutzeroberfläche herunterfahren
es_es: Cierre de la interfaz gráfica de usuario
fr_fr: Fermer l'interface graphique
it_it: Escludi GUI
nl_nl: GUI uitschakelen
pl_pl: Wyłącz GUI
ro_ro: Închideți GUI

source: Shutting Down the GUI!
de_de: Graphische Benutzeroberfläche herunterfahren!
es_es: Cerrando la interfaz gráfica de usuario (!)
fr_fr: Fermeture de l’interface graphique !

source: Side
de_de: Seite
es_es: Lado
fr_fr: Côté
it_it: Lato
nl_nl: Zijde
pl_pl: Strona
ro_ro: Lateral

source: Slave Offset
es_es: Compensación de esclavo
fr_fr: Compensation esclave

source: Slide
de_de: Schieben
es_es: Deslizamiento
fr_fr: Coulisseau
it_it: Scorri
nl_nl: Slede
pl_pl: Suwak
ro_ro: Glisare

source: Slide Pos
de_de: Schiebestellung
es_es: Pos. de deslizamiento
fr_fr: Position du coulisseau

source: Slide State
de_de: Schiebezustand
es_es: Estado de deslizamiento
fr_fr: État de glissement

source: Slide To Left
de_de: Nach links schieben
es_es: Deslizamiento a la izquierda
fr_fr: Glisser à gauche
it_it: Scorri a sinistra
nl_nl: Slede naar links
pl_pl: Przesuń do lewej
ro_ro: Glisați la stânga

source: Slide To Right
de_de: Nach rechts schieben
es_es: Deslizamiento a la derecha
fr_fr: Glisser à droite
it_it: Scorri a destra
nl_nl: Slede naar rechts
pl_pl: Przesuń do prawej
ro_ro: Glisați la dreapta

source: Small
de_de: Klein
es_es: Pequeño
fr_fr: Petit
it_it: Piccolo
nl_nl: Klein
pl_pl: Małe
ro_ro: Nivel mic

source: Software Version
es_es: Versión de software
fr_fr: Version du logiciel
it_it: Versione software
nl_nl: Softwareversie
pl_pl: Wersja oprogramowania
ro_ro: Versiune software

# SomeInkSuppliesAreOff
source: Some ink supplies are OFF. Print anyway?
de_de: Einige Tintenvorräte sind AUS. Trotzdem drucken?
es_es: Algunos suministros de tinta están en DESACTIVADOS. ¿Imprimir igualmente?
fr_fr: Certaines réserves d’encre sont désactivées. Imprimer quand même ?

source: Source Data
de_de: Quelldaten
es_es: Datos de origen
fr_fr: Données source
it_it: Dati origine
nl_nl: Brongegevens
pl_pl: Dane źródłowe
ro_ro: Date sursă

source: Spanish
de_de: Spanisch
es_es: Español
fr_fr: Espagnol

source: Speed
de_de: Geschwindigkeit
es_es: Velocidad
fr_fr: Vitesse
it_it: Velocità
nl_nl: Snelheid
pl_pl: Prędkość
ro_ro: Viteza

source: Speed Max
de_de: Geschwindigkeit Max
es_es: Velocidad máx.
fr_fr: Vitesse maximale

source: Speed Offset
de_de: Geschwindigkeits-Offset
es_es: Compensación de velocidad
fr_fr: Compensation de la vitesse

source: Speed Unit
de_de: Geschwindigkeit (Einheit)
es_es: Unidad de velocidad
fr_fr: Unité de vitesse
it_it: Unità di velocità
nl_nl: Snelheidseenheid
pl_pl: Jednostka prędkości
ro_ro: Unitate viteză

source: Splicing
de_de: Spleißen
es_es: Empalme
fr_fr: Raccordement
it_it: Giunzione
nl_nl: Splitsing
pl_pl: Łączenie
ro_ro: Îmbinare

source: Splicing Type
de_de: Spleißtyp
es_es: Tipo de empalme
fr_fr: Type de raccordement

source: Spread Roller
de_de: Auftragungsrolle
es_es: Rodillo de extensión
fr_fr: Rouleau d'expansion
it_it: Rullo di stenditura
pl_pl: Wałek rozfałdowujący
ro_ro: Roller expansiune

source: St
es_es: Estado
fr_fr: État
pl_pl: Stan

source: Start at
de_de: Starten bei
es_es: Inicio en
fr_fr: Démarrer à
it_it: Avvio a
nl_nl: Start op
pl_pl: Uruchom o
ro_ro: Start la

# ConfirmStartGluing
source: Start Gluing?
de_de: Mit der Verklebung beginnen?
es_es: ¿Iniciar encolado?
fr_fr: Démarrer le collage ?

# ConfirmStartWashingTheBelt
source: Start Washing the belt?
de_de: Mit dem Waschen des Bandes beginnen?
es_es: ¿Iniciar lavado de la cinta?
fr_fr: Démarrer le nettoyage de la bande ?

source: State
de_de: Zustand
es_es: Estado
fr_fr: État
it_it: Stato
nl_nl: Staat
pl_pl: Stan
ro_ro: Stare

source: Static
de_de: Statisch
es_es: Estático
fr_fr: Statique
it_it: Statico
nl_nl: Statisch
pl_pl: Statyczne

source: Status
es_es: Estado
fr_fr: Statut
it_it: Stato
ro_ro: Stare

source: Stepper
es_es: Controlador gradual
fr_fr: Pas à pas
it_it: Motore passo-passo
nl_nl: Stappenmotor
pl_pl: Silnik krokowy

source: Stepper Left
de_de: Stepper links
es_es: Controlador gradual izquierdo
fr_fr: Pas à pas à gauche
it_it: Motore passo-passo sinistra
nl_nl: Stappenmotor links
pl_pl: Silnik krokowy lewy
ro_ro: Stepper stânga

source: Stepper Right
de_de: Stepper rechts
es_es: Controlador gradual derecho
fr_fr: Pas à pas à droite
it_it: Motore passo-passo destra
nl_nl: Stappenmotor rechts
pl_pl: Silnik krokowy prawy
ro_ro: Stepper dreapta

source: Stitch
es_es: Puntos
it_it: Punto
ro_ro: Colaj

source: Stop
de_de: Stoppen
es_es: Parada
fr_fr: Arrêter
it_it: ARRESTO

source: Stop Dist
de_de: Stop dist (Stoppabst.)
es_es: Dist. de parada
fr_fr: Distance d’arrêt

source: Substrate Settings
de_de: Substrateinstellungen
es_es: Configuración del sustrato
fr_fr: Paramètres du substrat
it_it: Impostazioni substrato
nl_nl: Substraatinstellingen
pl_pl: Ustawienia podłoża
ro_ro: Setări substrat

source: Supervision
de_de: Überwachung
es_es: Supervisión
fr_fr: Surveillance

source: Support Commands
de_de: Vom technischen Support verwendete Befehle
es_es: Comandos de soporte
fr_fr: Commandes du support technique
it_it: Comandi supporto
nl_nl: Ondersteuningsopdrachten
pl_pl: Polecenia dla zespołu technicznego
ro_ro: Comenzi suport

source: Switch OFF
de_de: AUSschalten
es_es: Apagado INACTIVO
fr_fr: Éteignez

source: System Time
de_de: Systemzeit
es_es: Tiempo del sistema
fr_fr: Heure du système
it_it: Tempo sistema
nl_nl: Systeemtijd
pl_pl: Czas systemowy
ro_ro: Coordonate orare sistem

source: Table
de_de: Tisch
es_es: Mesa
it_it: Tavola
nl_nl: Tafel
pl_pl: Stół
ro_ro: Tabel

source: Task Switch
de_de: Aufgabenschalter
es_es: Cambio de tarea
fr_fr: Changement de tâche
it_it: Interruttore compito
nl_nl: Taakschakelaar
pl_pl: Przełącznik zadań
ro_ro: Comutator activitate

source: Temp Down
de_de: Temp.-Abfall
es_es: Bajada de temp.
fr_fr: Baisse de temp.
it_it: Temp giù
nl_nl: Temp omlaag
pl_pl: Obniżenie temp.
ro_ro: Reducere temp

source: Temperature Conditioner
de_de: Temperatur Conditioner
es_es: Acondicionador de temperatura
fr_fr: Température conditionneur
it_it: Condizionatore di temperatura
nl_nl: Temperatuurconditioner
pl_pl: Kondycjoner termiczny
ro_ro: Conditioner temperatură

source: Temperature Head
de_de: Temperatur Kopf
es_es: Temperatura cabezal
fr_fr: Température tête
it_it: Testina di temperatura
nl_nl: Temperatuurkop
pl_pl: Głowica termiczna
ro_ro: Cap temperatură

source: Temperature InkSupply
de_de: Temperatur Tintenzufuhr
es_es: Temperatura suministro de tinta
fr_fr: Température alimentation en encre
it_it: Alimentazione inchiostro temperatura
nl_nl: Temperatuur inkttoevoer
pl_pl: Zasilanie tuszem termicznym
ro_ro: Temperatură InkSupply

source: Temp Up
de_de: Temp.-Anstieg
es_es: Subida de temp.
fr_fr: Hausse de temp.
it_it: Temp Su
nl_nl: Temp omhoog
pl_pl: Wzrost temp.
ro_ro: Creștere temp

source: Tension
de_de: Spannung
es_es: Tensión
it_it: Tensione
nl_nl: Spanning
pl_pl: Napięcie
ro_ro: Tensiune

source: Tension NIP
de_de: Spannung NIP
es_es: Tensión NIP
fr_fr: Tension de pincement

source: Tension Offset
de_de: Spannungs-Offset
es_es: Compensación de tensión
fr_fr: Compensation de la tension
it_it: Offset tensione
nl_nl: Spanning offset
pl_pl: Offset napięcia
ro_ro: Offset Tensiune

source: Tension RW
de_de: Spannung RW
es_es: Tensión RW
fr_fr: Tension enrouleur

source: Tension UW
de_de: Spannung UW
es_es: Tensión UW
fr_fr: Tension dérouleur

source: Test
es_es: Prueba

source: Test Image
de_de: Testbild
es_es: Imagen de prueba
fr_fr: Image test
it_it: Prova immagine
nl_nl: Testafbeelding
pl_pl: Obraz testowy
ro_ro: Imaginea de test

source: Text
es_es: Texto
fr_fr: Texte
it_it: Testo
nl_nl: Tekst
pl_pl: Tekst

# UvLampIsNotReady
source: The UV Lamp is NOT READY. Start Printing?
de_de: Die UV-Lampe ist NICHT BEREIT. Zu drucken starten?
es_es: La lámpara UV NO ESTÁ LISTA. ¿Iniciar la impresión?
fr_fr: La lampe UV n’est PAS PRÊTE. Démarrer l’impression ?

source: Thickness
de_de: Dicke
es_es: Espesor
fr_fr: Épaisseur

source: Time
de_de: Zeit
es_es: Tiempo
fr_fr: Temps
it_it: Tempo
nl_nl: Tijd
pl_pl: Czas
ro_ro: Coordonate orare

source: Timer
es_es: Temporizador
fr_fr: Temps

source: Title
de_de: Titel
es_es: Título
fr_fr: Titre
it_it: Titolo
nl_nl: Titel
pl_pl: Tytuł
ro_ro: Titlu

source: To
de_de: Bis
es_es: A
fr_fr: Vers
it_it: A
nl_nl: Naar
pl_pl: Do
ro_ro: La

source: Type
de_de: Typ
es_es: Tipo
it_it: Tipo
pl_pl: Typ
ro_ro: Tip

source: Units
de_de: Einheiten
es_es: Unidades
fr_fr: Unités
it_it: Unità
nl_nl: Eenheden
pl_pl: Jednostki
ro_ro: Unități

source: Unused
de_de: Nicht verwendet
es_es: No usado
fr_fr: Non utilisé
it_it: Inutilizzato
nl_nl: Ongebruikt
pl_pl: Nieużywane
ro_ro: Neutilizate

source: Unwinder
de_de: Abwickler
es_es: Desbobinadora
fr_fr: Dérouleur
it_it: Svolgitore
nl_nl: Afwikkelaar
pl_pl: Odwijarka
ro_ro: Desfășurător

source: Unwinder Buffer
de_de: Abwicklerpuffer
es_es: Búfer de la desbobinadora
fr_fr: Tampon du dérouleur
it_it: Buffer svolgitore
nl_nl: Afwikkelaar Bufffer
pl_pl: Bufor odwijarki
ro_ro: Buffer desfășurător

source: Unwinder Core
de_de: Abwicklerkern
es_es: Centro de la desbobinadora
fr_fr: Noyau du dérouleur

source: Unwinder diameter
de_de: Abwicklerdurchmesser
es_es: Diámetro de la desbobinadora
fr_fr: Diamètre du dérouleur

source: Unwinder Standstill
de_de: Abwicklerstillstand
es_es: Parada de la desbobinadora
fr_fr: Arrêt du dérouleur
it_it: Svolgitore fermo
nl_nl: Afwikkelaar Stilstand
pl_pl: Postój odwijarki
ro_ro: Blocare desfășurător

source: Unwinder Tension
de_de: Abwicklerspannung
es_es: Tensión de la desbobinadora
fr_fr: Tension dérouleur
it_it: Tensione svolgitore
nl_nl: Afwikkelaar Spanning
pl_pl: Napięcie odwijarki
ro_ro: Tensiune desfășurător

source: Unwinder Ø
de_de: Abwickler Ø
es_es: Desbobinadora Ø
fr_fr: Dérouleur Ø

source: Up
de_de: Aufwärts
es_es: Arriba
fr_fr: Haut
it_it: Su
nl_nl: Omhoog
pl_pl: W górę
ro_ro: Sus

source: Updating Windows!
de_de: Windows aktualisieren!
es_es: Actualización de Windows (!)
fr_fr: Fenêtres de mise à jour !

source: User Account
de_de: Benutzerkonto
es_es: Cuenta de usuario
fr_fr: Compte utilisateur
it_it: Account utente
nl_nl: Gebruikersaccount
pl_pl: Konto użytkownika
ro_ro: Cont utilizator

source: UV Dryer
de_de: UV-Trockner
es_es: Secador UV
fr_fr: Séchoir UV

source: UV Flexo 1
es_es: Flexo UV 1

source: UV Flexo 2
es_es: Flexo UV 2

source: UV Flexo 3
es_es: Flexo UV 3

source: UV Flexo 4
es_es: Flexo UV 4

source: UV Lamp
de_de: UV-Lampe
es_es: Lámpara UV
fr_fr: Lampe UV

source: UV Lamps Ready
de_de: UV-Lampen bereit
es_es: Lámpara UV lista
fr_fr: Lampes UV prêtes

source: UV Printer
de_de: UV-Drucker
es_es: Impresora UV
fr_fr: Imprimante UV

source: UV Ready
de_de: UV-bereit
es_es: UV listo
fr_fr: Prêt UV
it_it: UV Pronto
nl_nl: UV klaar
pl_pl: Lampa UV gotowa
ro_ro: UV disponibil

# UwTension0
source: UW Tension &amp; Ø
de_de: Spannung &amp; Ø des Abwicklers
es_es: Tensión desbobinado &amp; Ø
fr_fr: Tension dérouleur &amp; Ø
it_it: Tensione UW & Ø
nl_nl: Afw Spanning & Ø
pl_pl: Napięcie i Ø odwijarki
ro_ro: UW Tensiune & Ø

source: Vacuum
de_de: Vakuum
es_es: Vacío
fr_fr: Vide
it_it: Vuoto
nl_nl: Vacuüm
pl_pl: Podciśnienie

source: Valve
de_de: Ventil
es_es: Válvula
fr_fr: Vanne
it_it: Valvola
nl_nl: Klep
pl_pl: Zawór
ro_ro: Supapă

source: Version
es_es: Versión
it_it: Versione
nl_nl: Versie
pl_pl: Wersja
ro_ro: Versiune

source: Verso
de_de: Rückseite
es_es: Reverso

source: Volume
de_de: Lautstärke
es_es: Volumen
pl_pl: Objętość
ro_ro: Volum

source: Wakeup
de_de: Wecken
es_es: Despertador
fr_fr: Réveil
pl_pl: Wznowienie
ro_ro: Inițializare

source: Wash
de_de: Waschen
es_es: Lavar
fr_fr: Laver
it_it: Lavare
nl_nl: Was
pl_pl: Mycie
ro_ro: Spălați

source: Washing
de_de: Waschen
es_es: Lavado
fr_fr: Lavage

source: Washing Unit
de_de: Waschanlage
es_es: Unidad de lavado
fr_fr: Unité de lavage
it_it: Unità di lavaggio
nl_nl: Waseenheid
pl_pl: Jednostka myjąca
ro_ro: Unitate Spălare

source: Washing UP
de_de: Spülen
es_es: Lavado ARRIBA
fr_fr: Lavage SUPÉRIEUR

source: Waste
de_de: Abfall
es_es: Residuos
fr_fr: Déchet
it_it: Rifiuti
nl_nl: Afval
pl_pl: Odpady
ro_ro: Deșeuri

source: Water OFF Time
de_de: Wasser OFF-Zeit
es_es: Tiempo de APAGADO del agua
fr_fr: Temps d’arrêt de l’eau

source: Water ON Time
de_de: Wasser ON-Zeit
es_es: Tiempo de ENCENDIDO del agua
fr_fr: Durée de fonctionnement de l’eau

source: Web-Out Offset
de_de: Bahn-Out Offset
es_es: Compensación de fuera de la banda
fr_fr: Compensation hors bobine

source: Web In
de_de: Bahn In
es_es: Banda dentro
fr_fr: Entrée de la bobine

source: Web Length
de_de: Bahnbreite
es_es: Longitud de la banda
fr_fr: Longueur bobine
it_it: Lunghezza nastro
nl_nl: Weglengte
pl_pl: Długość wstęgi
ro_ro: Lungime web

source: Web Out
de_de: Bahn Out
es_es: Salir de banda
fr_fr: Sortie de la bobine

source: Web tensions
de_de: Bahnspannungen
es_es: Tensiones de la banda
fr_fr: Tensions bobine
it_it: Tensioni nastro
nl_nl: Webspanningen
pl_pl: Naprężenie wstęgi
ro_ro: Tensiuni web

source: Web Width
de_de: Bahnbreite
es_es: Anchura de la banda
fr_fr: Largeur de la bobine

source: Week
de_de: Woche
es_es: Semana
fr_fr: Semaine
it_it: Settimana
pl_pl: Tydzień
ro_ro: Săptămână

source: Weekend
de_de: Wochenende
es_es: Fin de semana
it_it: Fine settimana
