Repository: marcel-galliker/Mouvent-PrintEngine
Catalog: mvt_digiprint_gui/Resources/Language/Resources.*.resx
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pl_pl, ro_ro

source: Head Adjustment View
de_de: Kopfeinstellungsansicht
es_es: Vista del ajuste del cabezal
fr_fr: Vue de l'ajustement de la tête
it_it: Visualizza regolazione testine
nl_nl: Weergave aanpassing kop
pl_pl: Podgląd regulacji głowicy
ro_ro: Vizualizare reglare cap

source: Head Align
de_de: Kopf ausrichten
es_es: Alineación del cabezal
fr_fr: Alignement des têtes
it_it: Allineamento testine
nl_nl: Uitlijnen kop
pl_pl: Wyrównanie głowicy
ro_ro: Aliniere cap

source: Head in Printing Position
de_de: Kopf in Druckposition
es_es: Cabezal en posición de impresión
fr_fr: Tête en position d'impression
it_it: Testina in posizione di stampa
nl_nl: Kop in afdrukpositie
pl_pl: Głowica w pozycji drukowania
ro_ro: Capul în poziția de printare

source: Head is UP
de_de: Kopf ist OBEN
es_es: El cabezal está ARRIBA
fr_fr: Tête en haut

source: Head Reference
de_de: Kopfreferenz
es_es: Referencia del cabezal
fr_fr: Tête référencée

source: Heads / Color
de_de: Köpfe / Farbe
es_es: Cabezales / Color
fr_fr: Têtes / couleur
it_it: Testine / colore
nl_nl: Koppen / kleur
pl_pl: Głowice/kolor
ro_ro: Capete / Culoare

# HeadsPrintPos
source: Heads at Print Pos
de_de: Köpfe in Druckpos.
es_es: Cabezales en Pos. Impr.
fr_fr: Têtes en pos. d'impression
it_it: Testine in Pos stampa
nl_nl: Koppen bij Printpos
pl_pl: Głowice w poz. drukowania
ro_ro: Capete la Poz Print

source: Heads Referenced
de_de: Referenzierte Köpfe
es_es: Cabezales referenciados
fr_fr: Têtes référencées
it_it: Riferimento testine
nl_nl: Koppen waarnaar wordt verwezen
pl_pl: Głowice z odniesieniami
ro_ro: Capete referențiate

# Height
source: Height [mm]
de_de: Höhe [mm]
es_es: Altura [mm]
fr_fr: Hauteur [mm]
it_it: Altezza [mm]
nl_nl: Hoogte [mm]
pl_pl: Wysokość [mm]
ro_ro: Înălțime (mm)

source: Host Name
es_es: Nombre del anfitrión
fr_fr: Nom de l'hôte
it_it: Nome host
nl_nl: Hostnaam
pl_pl: Nazwa hosta
ro_ro: Nume Gazdă

source: Identify
de_de: Identifizieren
es_es: Identificar
fr_fr: Identifier
it_it: Identificare
nl_nl: Identificeer
pl_pl: Identyfikuj
ro_ro: Identificați

source: Image
de_de: Bild
es_es: Imagen
it_it: Immagine
nl_nl: Afbeelding
pl_pl: Obraz
ro_ro: Imagine

source: Image Gap
de_de: Bildlücke
es_es: Espacio de la imagen
fr_fr: Écart image
it_it: Spazio tra immagini
nl_nl: Afbeeldingsgap
pl_pl: Odstęp między obrazami
ro_ro: Spațiere imagine

# ImageInCnt
source: Image In Cnt (Buffer)
de_de: Bild in Mitte (Puffer)
es_es: Imagen en centro (Búfer)
fr_fr: Image dans le compteur (Tampon)
it_it: Immagine In Cont (buffer)
nl_nl: Afbeelding In Center (Buffer)
pl_pl: Obraz na środku (bufor)
ro_ro: Imagine în Cnt (buffer)

source: Image Margin
de_de: Bildrand
es_es: Margen de la imagen
fr_fr: Marge image
it_it: Margine immagine
nl_nl: Afbeeldingsmarge
pl_pl: Margines dla obrazu
ro_ro: Margine imagine

source: Image Settings
de_de: Bildeinstellungen
es_es: Configuración de la imagen
fr_fr: Paramètres image
it_it: Impostazioni immagine
nl_nl: Afbeeldingsinstellingen
pl_pl: Ustawienia obrazu
ro_ro: Setări imagine

source: Info
es_es: Información
pl_pl: Informacje

source: Init Barcode Scanner
es_es: Iniciar lector de código de barras
fr_fr: Init lecteur de code-barre

# ConfirmInitBarcodeScanner
source: Init Barcode Scanner {0}?
es_es: ¿Iniciar lector de código de barras {0}?
fr_fr: Init lecteur de code-barre {0} ?

source: Ink
de_de: Tinte
es_es: Tinta
fr_fr: Encre
it_it: Inchiostro
nl_nl: Inkt
pl_pl: Tusz
ro_ro: Cerneală

source: Ink Color
de_de: Tintenfarbe
es_es: Color de tinta
fr_fr: Couleur d'encre
it_it: Colore inchiostro
nl_nl: Inktkleur
pl_pl: Kolor tuszu
ro_ro: Culoare cerneală

source: Ink Cylinder
de_de: Tintenzylinder
es_es: Cilindro de tinta
fr_fr: Cylindre d'encre
it_it: Cilindro inchiostro
nl_nl: Inktcilinder
pl_pl: Cylinder z tuszem
ro_ro: Cilindru cerneală

source: Ink Cylinders / Color
de_de: Tintenzylinder/Farbe
es_es: Cilindros / Color de tinta
fr_fr: Cylindres d'encre / Couleur
it_it: Cilindri / Colore inchiostro
nl_nl: Inktcilinders / Kleur
pl_pl: Cylindry z tuszem/kolor
ro_ro: Cilindri cerneală / Culoare

source: Ink Roller Speed
de_de: Geschwindigkeit der Tintenwalze
es_es: Velocidad del rollo de tinta
fr_fr: Vitesse du rouleau encreur

source: Ink Supply
de_de: Tintenzufuhr
es_es: Suministro de tinta
fr_fr: Alimentation en encre
it_it: Alimentazione inchiostro
nl_nl: Inkttoevoer
pl_pl: Zasilanie tuszem
ro_ro: Furnizare cerneală

source: Ink Supply Commands
de_de: Tintenzufuhr-Befehle
es_es: Comandos de suministro de tinta
fr_fr: Commande d'alimentation en encre
it_it: Comandi alimentazione inchiostro
nl_nl: Inkttoevoeropdrachten
pl_pl: Polecenia zasilania tuszem
ro_ro: Comenzi furnizare cerneală

source: Ink Tank Pressure
de_de: Tintenbehälterdruck
es_es: Presión del depósito de tinta
fr_fr: Pression du réservoir d’encre
it_it: Pressione serbatoio inchiostro
nl_nl: Inkttankdruk
pl_pl: Ciśnienie w zbiorniku z tuszem
ro_ro: Presiunea rezervorului de cerneală

# InsertPurgeTray
source: Insert purge tray. Continue?
de_de: Setzen Sie die Spülablage ein. Fortfahren?
es_es: Introducir bandeja de purga. ¿Continuar?
fr_fr: Insérez le tiroir Voulez-vous continuer ?

source: Invalid jet Nr:
de_de: Ungültige Strahlnr.:
es_es: Nº de chorro no válido:
fr_fr: Nombre de jets invalides :

source: IP Address
de_de: IP-Adresse
es_es: Dirección IP
fr_fr: Adresse IP
it_it: Indirizzo IP
nl_nl: IP-adressen
pl_pl: Adres IP
ro_ro: Adresă IP

source: IR-Heater
de_de: IR-Heizung
es_es: Calentador IR
fr_fr: Chauffage IR

# IsTheMachineReadyToPrint
source: Is the machine ready to print? No Splices in the machine?
de_de: Ist das Gerät druckbereit? Keine Klebestellen im Gerät?
es_es: ¿Está la máquina lista para imprimir? No ¿Hay empalmes en la máquina?
fr_fr: La machine est-elle prête à imprimer ? Pas d’épissures dans la machine ?

source: Italian
de_de: Italienisch
es_es: Italiano
fr_fr: Italien

source: Jet Compensation
de_de: Strahlkompensation
es_es: Compensación del chorro
fr_fr: Compensation des jets
it_it: Compensazione getto
nl_nl: Straalcompensatie
pl_pl: Kompensacja strumienia
ro_ro: Compensare jet

source: Jet Number
de_de: Strahlnummer
es_es: Número de chorro
fr_fr: Nombre de jets
it_it: Numero getto
nl_nl: Straalnummer
pl_pl: Numer strumienia
ro_ro: Număr jet

source: Jet Overcorrection
de_de: Strahlüberkorrektur
es_es: Sobrecorrección del chorro
fr_fr: Sur-correction du jet

source: Lamp time
de_de: Lampenzeit
es_es: Tiempo de funcionamiento de la lámpara
fr_fr: Durée de séchage lampe
it_it: Tempo lampada
nl_nl: Lamptijd
pl_pl: Czas pracy lampy
ro_ro: Coordonate orare lampă

source: Language
de_de: Sprache
es_es: Idioma
fr_fr: Langue
it_it: Lingua
nl_nl: Taal
pl_pl: Język
ro_ro: Limba

source: Large
de_de: Groß
es_es: Grande
fr_fr: Grand
it_it: Grande
nl_nl: Groot
pl_pl: Duże
ro_ro: Nivel mare

source: Laser
es_es: Láser

source: Left OUT
de_de: WEGgelassen
es_es: SALIR de izquierda

source: Len
de_de: Län
es_es: Longitud
fr_fr: Longueur
it_it: Lungh
pl_pl: Dł.
ro_ro: Lun.

source: Length
de_de: Länge
es_es: Longitud
fr_fr: Longueur
it_it: Lunghezza
nl_nl: Lengte
pl_pl: Długość
ro_ro: Lungime

source: Length IN
de_de: Länge EIN
es_es: Longitud DENTRO
fr_fr: Longueur au-dehors

source: Length OUT
de_de: Länge AUS
es_es: SALIR de longitud
fr_fr: Longueur au-dedans

source: Line
de_de: Zeile
es_es: Línea
fr_fr: Ligne
it_it: Linea
nl_nl: Lijn
pl_pl: Wiersz
ro_ro: Linie

source: Load
de_de: Laden
es_es: Cargar
fr_fr: Charger
it_it: Carica
nl_nl: Laden
pl_pl: Wczytaj
ro_ro: Încărcați

source: Log
de_de: Protokoll
es_es: Registro
fr_fr: Journal de bord
it_it: Registro
nl_nl: Logboek
pl_pl: Dziennik
ro_ro: Jurnal

source: Mac Address
de_de: Mac-Adresse
es_es: Dirección Mac
fr_fr: Adresse Mac
it_it: Indirizzo Mac
nl_nl: Mac-adres
pl_pl: Adres MAC
ro_ro: Adresă Mac

source: Machine
de_de: Maschine
es_es: Máquina
it_it: Macchina
pl_pl: Maszyna
ro_ro: Mașină

source: Machine State
de_de: Maschinenzustand
es_es: Estado de la máquina
fr_fr: État de la machine

source: Magnetic Band
de_de: Magnetisches Band
es_es: Banda magnética
fr_fr: Bande magnétique
it_it: Banda magnetica
nl_nl: Magnetische band
pl_pl: Taśma magnetyczna
ro_ro: Bandă magnetică

source: Main
de_de: Haupteinheit
es_es: Principal
fr_fr: Principal
it_it: Principale
pl_pl: Główna
ro_ro: Principal

source: MAIN-CTRL NOT CONNECTED
de_de: HAUPTSTEUERUNG NICHT VERBUNDEN
es_es: CTRL PRINCIPAL NO CONECTADO
fr_fr: COMMANDE PRINCIPALE NON CONNECTÉE
it_it: MAIN-CTRL NON CONNESSO
nl_nl: MAIN-CTRL NIET VERBONDEN
pl_pl: NIE PODŁĄCZONO STEROWNIKA GŁÓWNEGO
ro_ro: MAIN-CTRL NU ESTE CONECTAT

source: Maintenance
de_de: Wartung
es_es: Mantenimiento

source: Man Splicing
de_de: Man Klebung
es_es: Empalme manual
fr_fr: Raccordement manuel

source: Mask Length
de_de: Maskenlänge
es_es: Longitud de máscara
fr_fr: Longueur du masque

source: Masks/Blade
de_de: Masken/Klinge
es_es: Máscaras/cuchilla
fr_fr: Masques/lame

source: Mat Flexibility
de_de: Mat Flexibilität
es_es: Flexibilidad de la estera
fr_fr: Flexibilité du tapis

source: Max. disabled jets =
de_de: Max. deaktivierte Strahlen =
es_es: Chorros máximos desactivados =
fr_fr: Nombre maximal de jets désactivés =

source: Meniscus
de_de: Meniskus
es_es: Menisco
fr_fr: Ménisque
it_it: Menisco
pl_pl: Menisk
ro_ro: Menisc

source: Message
de_de: Nachricht
es_es: Mensaje
it_it: Messaggio
nl_nl: Bericht
pl_pl: Komunikat
ro_ro: Mesaj

source: metric
de_de: metrisch
es_es: métrica
fr_fr: métrique

source: Mid
de_de: Mitte
es_es: Medio
fr_fr: Milieu
it_it: Medio
nl_nl: Midden
pl_pl: Śr.
ro_ro: Mediu

source: Mixer Speed
de_de: Mixergeschwindigkeit
es_es: Velocidad del mixer
fr_fr: Vitesse du mélangeur

source: Mode
de_de: Modus
es_es: Modo
it_it: Modo
nl_nl: Modus
pl_pl: Tryb
ro_ro: Mod

source: Mode/Power
de_de: Modus/Leistung
es_es: Modo/potencia
fr_fr: Mode/Puissance

source: Moving
de_de: Bewegung
es_es: Mover
fr_fr: Déplacement
it_it: Spostamento
nl_nl: Bewegen
pl_pl: W ruchu
ro_ro: Deplasare

source: Name
es_es: Nombre
fr_fr: Nom
it_it: Nome
nl_nl: Naam
pl_pl: Nazwa
ro_ro: Nume

source: Net Mask
de_de: Netto-Maske
es_es: Máscara de red
fr_fr: Masque réseau
it_it: Maschera di rete
nl_nl: Netmasker
pl_pl: Maska sieci
ro_ro: Mască rețea

source: Network
de_de: Netzwerk
es_es: Red
fr_fr: Réseau
it_it: Rete
nl_nl: Netwerk
pl_pl: Sieć
ro_ro: Rețea

source: Next
de_de: Weiter
es_es: Siguiente
fr_fr: Suivant
it_it: Seguente
nl_nl: Volgende
pl_pl: Dalej
ro_ro: Următorul

source: Night
de_de: Nacht
es_es: Noche
fr_fr: Nuit
it_it: Notte
nl_nl: Nacht
pl_pl: Noc
ro_ro: Noapte

source: Nip Tension
de_de: Nip-Spannung
es_es: Tensión NIP
fr_fr: Tension de pincement
it_it: Tensione Nip
nl_nl: Nip Spanning
pl_pl: Napięcie docisku
ro_ro: Tensiune ghiară

source: No
de_de: Nein
es_es: N.º
fr_fr: Non
nl_nl: Nee
pl_pl: Nie
ro_ro: Nu

source: NOT CONNECTED
de_de: NICHT VERBUNDEN
es_es: NO CONECTADO
fr_fr: NON CONNECTÉ
it_it: NON CONNESSO
nl_nl: NIET VERBONDEN
pl_pl: NIE PODŁĄCZONO
ro_ro: NU ESTE CONECTAT (Ă)

source: Note
de_de: Hinweis
es_es: Nota
it_it: Nota
nl_nl: Opmerking
pl_pl: Uwaga
ro_ro: Notă

# NumberColors
source: Number of Colors
de_de: Anzahl Farben
es_es: Número de colores
fr_fr: Nombre de couleurs
it_it: Numero di colori
nl_nl: Aantal kleuren
pl_pl: Liczba kolorów
ro_ro: Număr de culori

source: Number Settings
de_de: Numerische Einstellungen
es_es: Configuración de números
fr_fr: Paramètres numériques
it_it: Impostazioni numero
nl_nl: Numerieke instellingen
pl_pl: Ustawienia numeracji
ro_ro: Setări număr

source: Offsets
es_es: Compensaciones
fr_fr: Compensations
it_it: Offset
pl_pl: Offset
ro_ro: Offset-uri

source: OFF Timer
de_de: ABSCHALTTimer
es_es: Temporizador DESACTIVADO
fr_fr: Délais d’extinction

source: OK
es_es: ACEPTAR

source: ONLY AVAILABLE IN ERROR STATE
de_de: NUR IM FEHLERZUSTAND VERFÜGBAR
es_es: SOLO DISPONIBLE EN ESTADO DE ERROR
fr_fr: DISPONIBLE UNIQUEMENT EN ÉTAT D'ERREUR
it_it: DISPONIBILE SOLO IN STATO DI ERRORE
nl_nl: ALLEEN BESCHIKBAAR IN FOUTTOESTAND
pl_pl: DOSTĘPNE TYLKO W STANIE BŁĘDU
ro_ro: DISPONIBIL NUMAI ÎN STARE DE EROARE

source: ON Timer
de_de: EINSCHALTTimer
es_es: Temporizador ACTIVADO
fr_fr: Délais d’allumage

source: Open File
de_de: Datei öffnen
es_es: Abrir archivo
fr_fr: Ouvrir fichier
it_it: Apri file
nl_nl: Open bestand
pl_pl: Otwórz plik
ro_ro: Deschideți fișier

source: Operator
de_de: Bediener
es_es: Operador
fr_fr: Opérateur
it_it: Operatore

source: Order
de_de: Bestellung
es_es: Pedido
fr_fr: Commande
it_it: Ordine
nl_nl: Bestelling
pl_pl: Zlecenie
ro_ro: Comandă

source: Orders
de_de: Bestellungen
es_es: Pedidos
fr_fr: Commandes
it_it: Ordini
nl_nl: Bestellingen
pl_pl: Zlecenia
ro_ro: Comenzi

source: Orientation
de_de: Ausrichtung
es_es: Orientación
it_it: Orientamento
nl_nl: Oriëntatie
pl_pl: Orientacja
ro_ro: Orientare

source: Overlap
de_de: Überlappung
es_es: Solapamiento
fr_fr: Chevauchement
it_it: Sovrapposizione
pl_pl: Nakładanie
ro_ro: Suprapunere

source: Page
de_de: Seite
es_es: Página
it_it: Pagina
nl_nl: Pagina
pl_pl: Strona
ro_ro: Pagină

source: Pages
de_de: Seiten
es_es: Páginas
it_it: Pagine
nl_nl: Pagina's
pl_pl: Strony
ro_ro: Pagini

source: Parameter
es_es: Parámetro
fr_fr: Paramètre
it_it: Parametro
pl_pl: Parametr
ro_ro: Parametru

source: Passes
de_de: Durchgänge
es_es: Pases
fr_fr: Passages
it_it: Passate
nl_nl: Pasjes
pl_pl: Przebiegi
ro_ro: Deplasări

source: Password
de_de: Passwort
es_es: Contraseña
fr_fr: Mot de passe
nl_nl: Wachtwoord
pl_pl: Hasło
ro_ro: Parolă

source: Pause
es_es: Pausa

source: Pause Up Delay
de_de: Unterbrechungsverzögerung
es_es: Retraso de la pausa hacia arriba
fr_fr: Délai de mise en pause

source: Pinning 1
de_de: Anheften 1
es_es: Clavijas 1
fr_fr: Ancrage 1

source: Pinning 2
de_de: Anheften 2
es_es: Clavijas 2
fr_fr: Ancrage 2

source: Pinning Lamp
de_de: Anstecklampe
es_es: Lámparas de clavijas
fr_fr: Lampe d’ancrage

source: PLC Info
de_de: SPS-Info
es_es: Información de PLC
fr_fr: Info API
it_it: Info PLC
pl_pl: Informacje o PLC
ro_ro: Informaţii PLC

source: PLC Log
de_de: SPS-Protokoll
es_es: Registro de PLC
fr_fr: Journal de bord API
it_it: Log PLC
pl_pl: Dziennik PLC
ro_ro: Jurnal PLC

source: PLC NOT CONNECTED
de_de: SPS NICHT VERBUNDEN
es_es: PLC NO CONECTADO
fr_fr: API NON CONNECTÉ
it_it: PLC NON CONNESSO
nl_nl: PLC NIET VERBONDEN
pl_pl: NIE PODŁĄCZONO PLC
ro_ro: PLC NU ESTE CONECTAT

source: Polish
de_de: Polnisch
es_es: Polaco
fr_fr: Polonais

source: Portuguese
de_de: Portugiesisch
es_es: Portugués
fr_fr: Portugais

source: Position X
es_es: Posición X
it_it: Posizione X
nl_nl: Positie X
pl_pl: Pozycja X
ro_ro: Poziție X

source: Position Y
es_es: Posición Y
it_it: Posizione Y
nl_nl: Positie Y
pl_pl: Pozycja Y
ro_ro: Poziție Y

source: Power
de_de: Leistung
es_es: Potencia
fr_fr: Puissance

source: Prepare
de_de: Vorbereitung
es_es: Preparar
fr_fr: Préparez

source: Prepare Active
de_de: Vorbereitung aktiv
es_es: Preparar activo
fr_fr: Préparez l’actif

# PrepareState
source: Prepare Sate
de_de: Vorbereitungsstatus
es_es: Estado de preparación
fr_fr: État de préparation
it_it: Stato preparazione
nl_nl: Bereid status voor
pl_pl: Stan przygotowania
ro_ro: Stare pregătire

source: Prepare State : PLC
de_de: Vorbereitungsstatus: SPS
es_es: Estado de preparación: PLC
fr_fr: État de préparation : API
it_it: Stato preparazione: PLC
nl_nl: Bereid status voor: PLC
pl_pl: Stan przygotowania: PLC
ro_ro: Stare pregătire: PLC

source: Prepare State : Print engine
de_de: Vorbereitungsstatus: Druckengine
es_es: Estado de preparación: Motor de impresión
fr_fr: État de préparation : Moteur d'impression
it_it: Stato preparazione: Motore stampa
nl_nl: Bereid status voor: Afdrukapparaat
pl_pl: Stan przygotowania: Mechanizm drukujący
ro_ro: Stare pregătire: Echipament printare

source: Pressure
de_de: Druck
es_es: Presión
fr_fr: Pression
it_it: Pressione
nl_nl: Druk
pl_pl: Ciśnienie
ro_ro: Presiune

source: Pressure Inlet
de_de: Druckeinlass
es_es: Entrada de presión
fr_fr: Pression d'admission
it_it: Entrata pressione
nl_nl: Drukinlaat
pl_pl: Ciśnienie wlotowe
ro_ro: Admisie presiune

source: Pressure Lung
de_de: Drucklungenautomat
es_es: Pulmón de presión
fr_fr: Pression du système de dégazage
it_it: Polmone pressione
nl_nl: Druklong
pl_pl: Ciśnienie odgazowywania
ro_ro: Organ presiune

source: Pressure Outlet
de_de: Druckauslass
es_es: Salida de presión
fr_fr: Pression de sortie
it_it: Uscita pressione
nl_nl: Drukuitlaat
pl_pl: Ciśnienie wylotowe
ro_ro: Ieșire presiune

source: Pressure Roller
de_de: Andruckrolle
es_es: Rodillo de presión
fr_fr: Rouleau de pression
it_it: Rullo pressione
nl_nl: Drukroller
pl_pl: Wałek dociskowy
ro_ro: Roller presiune

source: Pressure Roller in Start
de_de: Andruckrolle in Startposition
es_es: Rodillo de presión en inicio
fr_fr: Rouleau de pression en position de démarrage
it_it: Rullo pressione in fase avvio
nl_nl: Drukroller in Start
pl_pl: Wałek dociskowy w poz. startowej
ro_ro: Roller presiune la Start

source: Preview
de_de: Vorschau
es_es: Vista previa
fr_fr: Aperçu
it_it: Anteprima
nl_nl: Voorbeeld
pl_pl: Podgląd
ro_ro: Previzualizați

source: Print
de_de: Drucken
es_es: Impresión
fr_fr: Imprimer
it_it: Stampa
nl_nl: Afdrukken
pl_pl: Drukuj
ro_ro: Printați

source: Print dryer
de_de: Trockner
es_es: Secador de impresión
fr_fr: Séchoir
it_it: Essiccatore stampa
nl_nl: Afdrukdroger
pl_pl: Drukuj z suszarką
ro_ro: Uscător printare

source: Printed
de_de: Gedruckt
es_es: Impreso
fr_fr: Imprimé
it_it: Stampato
nl_nl: Gedrukt
pl_pl: Wydrukowano
ro_ro: Element printat

source: Print Environment
de_de: Druckumgebung
es_es: Entorno de impresión
fr_fr: Environnement d'impression
it_it: Ambiente di stampa
nl_nl: Afdrukomgeving
pl_pl: Środowisko druku
ro_ro: Mediu printare

source: Printer
de_de: Drucker
es_es: Impresora
fr_fr: Imprimante
it_it: Stampante
pl_pl: Drukarka
ro_ro: Imprimantă

source: Printer Nip Standstill
de_de: Drucker-Nip-Stillstand
es_es: Parada de NIP de impresora
fr_fr: Arrêt du pincement de l'imprimante
it_it: Nip stampante fermo
nl_nl: Printer Nip stilstand
pl_pl: Postój docisku drukarki
ro_ro: Imobilizare ghiară imprimantă

source: Printer Nip Tension
de_de: Drucker-Nip-Spannung
es_es: Tensión de NIP de impresora
fr_fr: Tension du pincement de l'imprimante
it_it: Tensione Nip stampante
nl_nl: Printer Nip Spanning
pl_pl: Napięcie docisku drukarki
ro_ro: Tensiune ghiară imprimantă

source: Printer Settings
de_de: Druckereinstellungen
es_es: Configuración de impresora
fr_fr: Paramètres de l'imprimante
it_it: Impostazioni stampante
nl_nl: Printerinstellingen
pl_pl: Ustawienia drukarki
ro_ro: Setări imprimantă

source: Printer Type
de_de: Druckertyp
es_es: Tipo de impresora
fr_fr: Type d'imprimante
it_it: Tipo stampante
pl_pl: Typ drukarki
ro_ro: Tip imprimantă

source: Print Go
de_de: Druckaktivierung (PrintGo)
es_es: Activación de la impresión
fr_fr: Activation de l'impression
it_it: Attivazione stampa

source: PrintGo Mode
de_de: Druckaktivierungsmodus (PrintGo)
es_es: Modo Activación de impresión
fr_fr: Mode activation de l'impression
it_it: Modalità Attivazione stampa
nl_nl: PrintGo-modus
pl_pl: Tryb PrintGo
ro_ro: Mod PrintGo

# PrintheadNotInCappingPosition
source: Printhead NOT in capping position. Continue?
de_de: Druckkopf NICHT in Abdeckposition. Fortfahren?
es_es: El cabezal de impresión NO está en posición de tapado. ¿Continuar?
fr_fr: La tête d’impression n’est PAS en position de recouvrement. Voulez-vous continuer ?

source: Print Heads
de_de: Druckköpfe
es_es: Cabezales de impresión
fr_fr: Têtes d'impression
it_it: Testine di stampa
nl_nl: Printkoppen
pl_pl: Głowice drukujące
ro_ro: Capete de printare

source: Print Height
de_de: Druckhöhe
es_es: Altura de impresión
fr_fr: Hauteur d’impression

source: Printing
de_de: Drucken
es_es: Imprimir
fr_fr: Impression
it_it: Stampa
nl_nl: Afdrukken
pl_pl: Drukowanie
ro_ro: Printare în curs

source: Printing Speed
de_de: Druckgeschwindigkeit
es_es: Velocidad de impresión
fr_fr: Vitesse d’impression

source: Printing Time
de_de: Druckzeit
es_es: Tiempo de impresión
fr_fr: Temps d'impression
it_it: Tempo di stampa
nl_nl: Afdruktijd
pl_pl: Czas drukowania
ro_ro: Durată printare

source: Print Queue
de_de: Druckwarteschlange
es_es: Cola de impresión
fr_fr: File d'attente d'impression
it_it: Coda di stampa
nl_nl: Wachtrij afdrukken
pl_pl: Kolejka wydruku
ro_ro: Coadă printare

source: Print Speed
de_de: Druckgeschwindigkeit
es_es: Velocidad de impresión
fr_fr: Vitesse d’impression

source: Print System
de_de: Drucksystem
es_es: Sistema de impresión
fr_fr: Système d'impression
it_it: Sistema di stampa
nl_nl: Afdruksysteem
pl_pl: System druku
ro_ro: Sistem printare

source: Print Tension
de_de: Druckspannung
es_es: Tensión de impresión
fr_fr: Tension d'impression
it_it: Tensione di stampa
nl_nl: Afdrukspanning
pl_pl: Napięcie druku
ro_ro: Tensiune printare

source: Print Test Image
de_de: Druck-Testbild
es_es: Imagen de prueba de impresión
fr_fr: Image de test d'impression
it_it: Immagine prova stampa
nl_nl: Testafbeelding afdrukken
pl_pl: Drukuj obraz testowy
ro_ro: Imagine de test printare

source: Print Unit Dryer
de_de: Trockner der Druckeinheit
es_es: Secador de unidad de impresión
fr_fr: Séchoir d'unité d'impression
it_it: Essiccatore unità di stampa
nl_nl: Printeenheiddroger
pl_pl: Drukarka z suszarką
ro_ro: Uscător unitate printare

source: Produced
de_de: Erzeugt
es_es: Producido
fr_fr: Produit
it_it: Prodotto
nl_nl: Geproduceerd
pl_pl: Wyprodukowano
ro_ro: Produs (ă)

source: Production
de_de: Produktion
es_es: Producción

source: Propagate correction values to all following print heads
de_de: Korrekturwerte an alle folgenden Druckköpfe weitergeben
es_es: Propagar los valores de corrección a todos los cabezales de impresión siguientes
fr_fr: Propager les valeurs de correction à toutes les têtes d'impression suivantes
it_it: Propaga valori di correzione a tutte le seguenti testine di stampa
nl_nl: Propageer correctiewaarden voor alle volgende printkoppen
pl_pl: Propaguj wartości korekty do wszystkich kolejnych głowic drukujących
ro_ro: Propagarea valorilor corecţiei la toate capetele de tipărire următoare

source: Pump Speed
de_de: Pumpendrehzahl
es_es: Velocidad de la bomba
fr_fr: Vitesse de la pompe
it_it: Velocità pompa
nl_nl: Pompsnelheid
pl_pl: Prędkość pompy
ro_ro: Viteză pompă

source: Purge
de_de: Reinigen
es_es: Purga
it_it: Spurga
nl_nl: Reinigen
pl_pl: Przeczyść
ro_ro: Purjare

# ShortPurgeAndVacc
source: Purge+Vacc
de_de: Reinigen+absaugen
es_es: Purgar+Vaciar
fr_fr: Purge + vide

# ShortPurgeAndWipe
source: Purge+Wipe
de_de: Reinigen+abwischen
es_es: Purgar+Limpiar
fr_fr: Purge + essuyage

source: Purge and vacuum
de_de: Reinigen und absaugen
es_es: Purga y vacío
fr_fr: Purge et vide
it_it: Spurgo e vuoto
nl_nl: Reinigen en stofzuigen
pl_pl: Przeczyść i odkurz
ro_ro: Purjare şi vacuum

source: Purge and wipe
de_de: Reinigen und abwischen
es_es: Purga y limpieza
fr_fr: Purge et essuyage
it_it: Spurga e pulisci
nl_nl: Reinigen en vegen
pl_pl: Przeczyść i przetrzyj
ro_ro: Purjare şi ștergere

source: PURGE and WIPE all printheads?
de_de: Alle Druckköpfe REINIGEN und ABWISCHEN?
es_es: ¿PURGAR y LIMPIAR todos los cabezales de impresión?
fr_fr: PURGER et ESSUYER toutes les têtes d’impression ?

source: Purge Hard
de_de: Intensives Reinigen
es_es: Purga intensa
fr_fr: Purge forte
it_it: Spurgo hard
nl_nl: Reinigen Hard
pl_pl: Przeczyszczanie dokładne
ro_ro: Purjare hard

source: Purge Micro
de_de: Mikroreinigung
es_es: Purga micro
it_it: Micro-spurgo
nl_nl: Reinigen Micro
pl_pl: Przeczyszczanie minimalne
ro_ro: Purjare micro

source: PURGE POS
de_de: REINIGUNGSPOSITION
es_es: PURGA POS.
fr_fr: PURGEZ le coulisseau

source: Purge Soft
de_de: Sanftes Reinigen
es_es: Purga suave
fr_fr: Purge douce
it_it: Spurgo soft
nl_nl: Reinigen Zacht
pl_pl: Przeczyszczanie łagodne
ro_ro: Purjare soft
