Repository: marcel-galliker/Mouvent-PrintEngine
Catalog: mvt_digiprint_gui/Resources/Language/Resources.*.resx
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pl_pl, ro_ro

# Width
source: Width [mm]
de_de: Breite [mm]
es_es: Anchura [mm]
fr_fr: Largeur [mm]
it_it: Larghezza [mm]
nl_nl: Breedte (mm)
pl_pl: Szerokość [mm]
ro_ro: Lățime (mm)

source: Winder Red
de_de: Wickler rot
es_es: Bobinadora roja
fr_fr: Bobinoir rouge

source: Winder Waste
de_de: Wicklerabfall
es_es: Residuos de la bobinadora
fr_fr: Déchets du bobinoir

source: Windows Commands
de_de: Windows-Befehle
es_es: Comandos de Windows
fr_fr: Commandes Windows
it_it: Comandi di Windows
nl_nl: Windows opdrachten
pl_pl: Polecenia Windows
ro_ro: Comenzi Windows

source: Windows Update
es_es: Actualización de Windows
fr_fr: Mise à jour Windows
it_it: Aggiornamento di Windows
ro_ro: Actualizare Windows

source: Wipe
de_de: Wischen
es_es: Limpiar
fr_fr: Essuyage
it_it: Pulire
nl_nl: Wis
pl_pl: Przetrzyj
ro_ro: Ștergeți

source: WIPE POS
de_de: WISCHPOS
es_es: LIMPIAR POS.
fr_fr: ESSUYEZ LE COULISSEAU

source: Wiping Delay
de_de: Wischverzögerung
es_es: Retraso en la limpieza
fr_fr: Retard d'essuyage
it_it: Ritardo pulitura
nl_nl: Wissen Vertraging
pl_pl: Opóźnienie przecierania
ro_ro: Interval ștergere

source: Wiping Height
de_de: Wischhöhe
es_es: Altura de limpieza
fr_fr: Hauteur d'essuyage
it_it: Altezza pulitura
nl_nl: Wissen Hoogte
pl_pl: Wysokość przecierania
ro_ro: Înălțime Ștergere

source: Wiping Speed
de_de: Wischgeschwindigkeit
es_es: Velocidad de la limpieza
fr_fr: Vitesse d'essuyage
it_it: Velocità pulitura
nl_nl: Wissen Snelheid
pl_pl: Prędkość przecierania
ro_ro: Viteză ștergere

source: Zone 1
es_es: Zona 1

source: Zone 2
es_es: Zona 2

source: Zone 3
es_es: Zona 3

source: Put bleed tube to empty canister.
de_de: Stecken Sie den Entlüftungsschlauch in den leeren Kanister.
es_es: Poner el tubo de purga en el bote vacío.
fr_fr: Mettez le tube de purge sur le bidon vide.

source: Put new ink canister.
de_de: Setzen Sie einen neuen Tintenbehälter ein.
es_es: Poner nuevo bote de tinta.
fr_fr: Mettez un nouveau réservoir d’encre.

source: Remove fill tube.
de_de: Füllrohr entfernen.
es_es: Eliminar tubo de llenado.
fr_fr: Retirez le tube de remplissage.

source: Black (K)
de_de: Schwarz (K)
es_es: Negro (K)
fr_fr: Noir (K)

source: Blue (B)
de_de: Blau (B)
es_es: Azul (B)
fr_fr: Bleu (B)

source: Cal Done
de_de: Kal erfolgt
es_es: Cal. lista
fr_fr: Étalonnage fait

source: Calib Done
de_de: Kalib erfolgt
es_es: Calib. lista
fr_fr: Étalonnage fait

source: Cal Offset
de_de: Kalib-Offset
es_es: Compensación cal.
fr_fr: Compensation de l’étalonnage

source: Check /0
de_de: Prüfen /0
es_es: Comprobar/0
fr_fr: Vérification /0

source: Check /1
de_de: Prüfen /1
es_es: Comprobar/1
fr_fr: Vérification /1

source: Check /2
de_de: Prüfen /2
es_es: Comprobar/2
fr_fr: Vérification /2

source: Check /3
de_de: Prüfen /3
es_es: Comprobar/3
fr_fr: Vérification /3

source: Check /4
de_de: Prüfen /4
es_es: Comprobar/4
fr_fr: Vérification /4

source: Check /5
de_de: Prüfen /5
es_es: Comprobar/5
fr_fr: Vérification /5

source: Check /6
de_de: Prüfen /6
es_es: Comprobar/6
fr_fr: Vérification /6

source: Check /7
de_de: Prüfen /7
es_es: Comprobar/7
fr_fr: Vérification /7

source: Check /8
de_de: Prüfen /8
es_es: Comprobar/8
fr_fr: Vérification /8

source: Check /9
de_de: Prüfen /9
es_es: Comprobar/9
fr_fr: Vérification /9

source: cluster
es_es: clúster
fr_fr: groupe

source: cut left
de_de: Links schneiden
es_es: cortar izquierda
fr_fr: coupez à gauche

source: cut right
de_de: Rechts schneiden
es_es: cortar derecha
fr_fr: coupez à droite

source: Cyan (C)
es_es: Cian (C)

source: Empty /1
de_de: Leer /1
es_es: Vaciar/1
fr_fr: Vide /1

source: Empty /2
de_de: Leer /2
es_es: Vaciar/2
fr_fr: Vide /2

source: Empty /3
de_de: Leer /3
es_es: Vaciar/3
fr_fr: Vide /3

source: Empty /4
de_de: Leer /4
es_es: Vaciar/4
fr_fr: Vide /4

source: Empty /5
de_de: Leer /5
es_es: Vaciar/5
fr_fr: Vide /5

source: Fill /1
de_de: Füllen /1
es_es: Llenar/1
fr_fr: Plein /1

source: Fill /2
de_de: Füllen /2
es_es: Llenar/2
fr_fr: Plein /2

source: Fill /3
de_de: Füllen /3
es_es: Llenar/3
fr_fr: Plein /3

source: Fill /4
de_de: Füllen /4
es_es: Llenar/4
fr_fr: Plein /4

source: Fill /5
de_de: Füllen /5
es_es: Llenar/5
fr_fr: Plein /5

source: fluid
de_de: Flüssigkeit
es_es: fluido
fr_fr: fluide

source: Flush /1
de_de: Spülen /1
es_es: Lavado /1

source: Flush /2
de_de: Spülen /2
es_es: Lavado /2

source: Flush /3
de_de: Spülen /3
es_es: Lavado /3

source: Flush /4
de_de: Spülen /4
es_es: Lavado /4

source: Flush Done
de_de: Spülung erledigt
es_es: Lavado listo
fr_fr: Flush fait

source: Flush N
de_de: Spülen N
es_es: Lavado N

source: Flush W
de_de: Spülen W
es_es: Lavado W
fr_fr: Flush B

source: Flush WE
de_de: Spülen WE
es_es: Lavado WE

source: Green (G)
de_de: Grün (G)
es_es: Verde (G)
fr_fr: Vert (G)

source: Knife large / Tape
de_de: Messer groß / Klebeband
es_es: Cuchillo grande / cinta
fr_fr: Couteau large / Ruban adhésif

source: Knife large / Ultrasonic
de_de: Messer groß / Ultraschall
es_es: Cuchillo grande / ultrasonidos
fr_fr: Couteau large / Ultrasonique

source: Knife small / Tape
de_de: Messer klein / Klebeband
es_es: Cuchillo pequeño / cinta
fr_fr: Couteau étroit / Ruban adhésif

source: Knife small / Ultrasonic
de_de: Messer klein / Ultraschall
es_es: Cuchillo pequeño / ultrasonidos
fr_fr: Couteau étroit / Ultrasonique

source: Light Black 2 (LLK)
de_de: Hellschwarz 2 (LLK)
es_es: Negro claro 2 (LLK)
fr_fr: Noir clair 2 (LLK)

source: Light Black 3 (3LK)
de_de: Hellschwarz 3 (3LK)
es_es: Negro claro 3 (3LK)
fr_fr: Noir clair 3 (3LK)

source: Light Black 4 (4LK)
de_de: Hellschwarz 4 (4LK)
es_es: Negro claro 4 (4LK)
fr_fr: Noir clair 4 (4LK)

source: Light Black 5 (5LK)
de_de: Hellschwarz 5 (5LK)
es_es: Negro claro 5 (5LK)
fr_fr: Noir clair 5 (5LK)

source: Light Black 6 (6LK)
de_de: Hellschwarz 6 (6LK)
es_es: Negro claro 6 (6LK)
fr_fr: Noir clair 6 (6LK)

source: Light Black (LK)
de_de: Hellschwarz (LK)
es_es: Negro claro (LK)
fr_fr: Noir clair (LK)

source: Light Blue (LB)
de_de: Hellblau (LB)
es_es: Azul claro (LB)
fr_fr: Bleu clair (LB)

source: Light Cyan 2 (LLC)
de_de: Hellcyan 2 (LLC)
es_es: Cian claro 2 (LLC)
fr_fr: Cyan clair 2 (LLC)

source: Light Cyan (LC)
de_de: Hellcyan (LC)
es_es: Cian claro (LC)
fr_fr: Cyan clair (LC)

source: Light Green (LG)
de_de: Hellgrün (LG)
es_es: Verde claro (LG)
fr_fr: Vert clair (LG)

source: Light Magenta 2 (LLM)
de_de: Hellmagenta 2 (LLM)
es_es: Magenta claro 2 (LLM)
fr_fr: Magenta clair 2 (LLM)

source: Light Magenta (LM)
de_de: Hellmagenta (LM)
es_es: Magenta claro (LM)
fr_fr: Magenta clair (LM)

source: Light Profile Channel 10 (LP10)
de_de: Lichtprofil Kanal 10 (LP10)
es_es: Canal de perfil luminoso 10 (LP10)
fr_fr: Canal de profil clair 10 (LP10)

source: Light Profile Channel 11 (LP11)
de_de: Lichtprofil Kanal 11 (LP11)
es_es: Canal de perfil luminoso 11 (LP11)
fr_fr: Canal de profil clair 11 (LP11)

source: Light Profile Channel 12 (LP12)
de_de: Lichtprofil Kanal 12 (LP12)
es_es: Canal de perfil luminoso 12 (LP12)
fr_fr: Canal de profil clair 12 (LP12)

source: Light Profile Channel 8 (LP8)
de_de: Lichtprofil Kanal 8 (LP8)
es_es: Canal de perfil luminoso 8 (LP8)
fr_fr: Canal de profil clair 8 (LP8)

source: Light Profile Channel 9 (LP9)
de_de: Lichtprofil Kanal 9 (LP9)
es_es: Canal de perfil luminoso 9 (LP9)
fr_fr: Canal de profil clair 9 (LP9)

source: Light Red (LR)
de_de: Hellrot (LR)
es_es: Rojo claro (LR)
fr_fr: Rouge clair (LR)

source: Light Spot Color 1 (LS1)
de_de: Helle Volltonfarbe 1 (LS1)
es_es: Punto de color claro 1 (LS1)
fr_fr: Couleur d’accompagnement claire 1 (LS1)

source: Light Spot Color 2 (LS2)
de_de: Helle Volltonfarbe 2 (LS2)
es_es: Punto de color claro 2 (LS2)
fr_fr: Couleur d’accompagnement claire 2 (LS2)

source: Light Spot Color 3 (LS3)
de_de: Helle Volltonfarbe 3 (LS3)
es_es: Punto de color claro 3 (LS3)
fr_fr: Couleur d’accompagnement claire 3 (LS3)

source: Light Spot Color 4 (LS4)
de_de: Helle Volltonfarbe 4 (LS4)
es_es: Punto de color claro 4 (LS4)
fr_fr: Couleur d’accompagnement claire 4 (LS4)

source: Light Spot Color 5 (LS5)
de_de: Helle Volltonfarbe 5 (LS5)
es_es: Punto de color claro 5 (LS5)
fr_fr: Couleur d’accompagnement claire 5 (LS5)

source: Light Spot Color 6 (LS6)
de_de: Helle Volltonfarbe 6 (LS6)
es_es: Punto de color claro 6 (LS6)
fr_fr: Couleur d’accompagnement claire 6 (LS6)

source: Light Yellow 2 (LLY)
de_de: Hellgelb 2 (LLY)
es_es: Amarillo claro 2 (LLY)
fr_fr: Jaune clair 2 (LLY)

source: Light Yellow (LY)
de_de: Hellgelb (LY)
es_es: Amarillo claro (LY)
fr_fr: Jaune clair (LY)

source: Midlayer (MID)
de_de: Mittelschicht (MID)
es_es: Capa intermedia (MID)
fr_fr: Couche intermédiaire (MID)

source: none
de_de: keine
es_es: ninguna
fr_fr: aucune

source: Profile Channel 10 (P10)
de_de: Profilkanal 10 (P10)
es_es: Canal de perfil 10 (P10)
fr_fr: Canal de profil 10 (P10)

source: Profile Channel 11 (P11)
de_de: Profilkanal 11 (P11)
es_es: Canal de perfil 11 (P11)
fr_fr: Canal de profil 11 (P11)

source: Profile Channel 12 (P12)
de_de: Profilkanal 12 (P12)
es_es: Canal de perfil 12 (P12)
fr_fr: Canal de profil 12 (P12)

source: Profile Channel 8 (P8)
de_de: Profilkanal 8 (P8)
es_es: Canal de perfil 8 (P8)
fr_fr: Canal de profil 8 (P8)

source: Profile Channel 9 (P9)
de_de: Profilkanal 9 (P9)
es_es: Canal de perfil 9 (P9)
fr_fr: Canal de profil 9 (P9)

source: Purge /1
de_de: Reinigen /1
es_es: Purgar/1

source: Purge /2
de_de: Reinigen /2
es_es: Purgar/2

source: Purge /3
de_de: Reinigen /3
es_es: Purgar/3

source: Purge /4
de_de: Reinigen /4
es_es: Purgar/4

source: Purge /5
de_de: Reinigen /5
es_es: Purgar/5

source: Purge /6
de_de: Reinigen /6
es_es: Purgar/6

source: Purge+Vacc
de_de: Reinigen+absaugen
es_es: Purgar+Vaciar
fr_fr: Purge + vide

source: Purge+Wipe
de_de: Reinigen+abwischen
es_es: Purgar+Limpiar
fr_fr: Purge + essuyage

source: Red/Orange (R)
de_de: Rot/Orange (R)
es_es: Rojo/naranja (R)
fr_fr: Rouge/Orange (R)

source: Robi Out
es_es: Salir de Robi
fr_fr: Sortie Robi

source: Robi Out /1
es_es: Salir de Robi/1
fr_fr: Sortie Robi /1

source: SD-Done
de_de: SD erledigt
es_es: SD listo

source: sonotrode
es_es: sonotrodo

source: spooler
es_es: bobinadora

source: Spot Color 1 (S1)
de_de: Volltonfarbe 1 (S1)
es_es: Punto de color 1 (S1)
fr_fr: Couleur d’accompagnement 1 (S1)

source: Spot Color 2 (S2)
de_de: Volltonfarbe 2 (S2)
es_es: Punto de color 2 (S2)
fr_fr: Couleur d’accompagnement 2 (S2)

source: Spot Color 3 (S3)
de_de: Volltonfarbe 3 (S3)
es_es: Punto de color 3 (S3)
fr_fr: Couleur d’accompagnement 3 (S3)

source: Spot Color 4 (S4)
de_de: Volltonfarbe 4 (S4)
es_es: Punto de color 4 (S4)
fr_fr: Couleur d’accompagnement 4 (S4)

source: Spot Color 5 (S5)
de_de: Volltonfarbe 5 (S5)
es_es: Punto de color 5 (S5)
fr_fr: Couleur d’accompagnement 5 (S5)

source: Spot Color 6 (S6)
de_de: Volltonfarbe 6 (S6)
es_es: Punto de color 6 (S6)
fr_fr: Couleur d’accompagnement 6 (S6)

source: tape
de_de: Band
es_es: cinta
fr_fr: ruban

source: Test WDG
es_es: Prueba WDG

source: ultrasonic
de_de: ultraschall
es_es: ultrasonido
fr_fr: ultrasonique

source: undef
es_es: indef.
fr_fr: non défini

source: Varnish / Finish 1 (V1)
de_de: Lack / Finish 1 (V1)
es_es: Barniz / acabado 1 (V1)
fr_fr: Vernis / Finition 1 (V1)

source: Varnish / Finish 2 (V2)
de_de: Lack / Finish 2 (V2)
es_es: Barniz / acabado 2 (V2)
fr_fr: Vernis / Finition 2 (V2)

source: Varnish / Finish 3 (V3)
de_de: Lack / Finish 3 (V3)
es_es: Barniz / acabado 3 (V3)
fr_fr: Vernis / Finition 3 (V3)

source: Varnish / Finish 4 (V4)
de_de: Lack / Finish 4 (V4)
es_es: Barniz / acabado 4 (V4)
fr_fr: Vernis / Finition 4 (V4)

source: Warm Up
de_de: Aufwärmen
es_es: Calentamiento
fr_fr: Réchauffez

source: Wash /1
de_de: Waschen /1
es_es: Lavado /1
fr_fr: Lavage /1

source: Wash /2
de_de: Waschen /2
es_es: Lavado /2
fr_fr: Lavage /2

source: Wash /3
de_de: Waschen /3
es_es: Lavado /3
fr_fr: Lavage /3

source: Wash /4
de_de: Waschen /4
es_es: Lavado /4
fr_fr: Lavage /4

source: Wash /5
de_de: Waschen /5
es_es: Lavado /5
fr_fr: Lavage /5

source: Wash /6
de_de: Waschen /6
es_es: Lavado /6
fr_fr: Lavage /6

source: White 1 (W1)
de_de: Weiß 1 (W1)
es_es: Blanco 1 (W1)
fr_fr: Blanc 1 (W1)

source: White 2 (W2)
de_de: Weiß 2 (W2)
es_es: Blanco 2 (W2)
fr_fr: Blanc 2 (W2)

source: White 3 (W3)
de_de: Weiß 3 (W3)
es_es: Blanco 3 (W3)
fr_fr: Blanc 3 (W3)

source: White 4 (W4)
de_de: Weiß 4 (W4)
es_es: Blanco 4 (W4)
fr_fr: Blanc 4 (W4)

source: Wipe /1
de_de: Wischen /1
es_es: Limpiar /1
fr_fr: Essuyage /1

source: Wipe /2
de_de: Wischen /2
es_es: Limpiar /2
fr_fr: Essuyage /2

source: Wipe /3
de_de: Wischen /3
es_es: Limpiar /3
fr_fr: Essuyage /3

source: Wipe /4
de_de: Wischen /4
es_es: Limpiar /4
fr_fr: Essuyage /4

source: Wipe /5
de_de: Wischen /5
es_es: Limpiar /5
fr_fr: Essuyage /5

source: Wipe /6
de_de: Wischen /6
es_es: Limpiar /6
fr_fr: Essuyage /6

source: Yellow (Y)
de_de: Gelb (Y)
es_es: Amarillo (Y)
fr_fr: Jaune (Y)

source: Boot Up
de_de: Hochfahren
es_es: Arrancar
fr_fr: Démarrage

source: Capping
de_de: Verschließen
es_es: Límite
fr_fr: Bouchage

source: Cleaf Project
de_de: Cleaf Projekt
es_es: Limpiar proyecto
fr_fr: Cleaf projet

source: Gap
de_de: Spalt
es_es: Intervalo
fr_fr: Écart

source: Glue
de_de: Kleber
es_es: Pegamento
fr_fr: Colle

source: Mark
de_de: Markierung
es_es: Marca
fr_fr: Marque

source: MarkI
de_de: MarkierungI
es_es: Marca I
fr_fr: MarqueI

source: MarkV
de_de: MarkierungV
es_es: Marca V
fr_fr: MarqueV

source: Paper
de_de: Papier
es_es: Papel
fr_fr: Papier

source: Radex Test Slide
de_de: Radex Objektträger
es_es: Radex prueba de deslizamiento
fr_fr: Lame de test Radex

source: Radex Test Slide Only
de_de: Nur Radex Objektträger
es_es: Radex solo prueba de deslizamiento
fr_fr: Lame de test Radex uniquement

source: Referencing
de_de: Referenzierung
es_es: Referencias
fr_fr: Référencement

source: Service
de_de: Leistung
es_es: Servicio
fr_fr: Maintenance

source: Start
de_de: Starten
es_es: Iniciar
fr_fr: Démarrer

source: Stopped
de_de: Gestoppt
es_es: Detenido
fr_fr: Arrêté

source: Swiss4Jet Test Table
de_de: Swiss4Jet Testtabelle
es_es: Mesa de pruebas Swiss4Jet
fr_fr: Table d’essai Swiss4Jet

source: Angle Overlapped
de_de: Winkelüberlappung
es_es: Ángulo superpuesto
fr_fr: Angle chevauché

source: Angle Separated
de_de: Winkeltrennung
es_es: Ángulo separado
fr_fr: Angle séparé

source: Comma
de_de: Komma
es_es: Coma
fr_fr: Virgule

source: Fixed
de_de: Festgelegt
es_es: Fijo
fr_fr: Fixe

source: Full Alignment
de_de: Vollständige Anpassung
es_es: Alineación total
fr_fr: Alignement complet

source: Grid
de_de: Raster
es_es: Rejilla
fr_fr: Grille

source: Jet Numbers
de_de: Strahlnummer
es_es: Números de chorros
fr_fr: Nombre de jets

source: Jets
de_de: Strahlen
es_es: Chorros

source: Mounted
de_de: Montiert
es_es: Montado
fr_fr: Monté

source: Running
de_de: Laufen
es_es: Ejecutando
fr_fr: En marche

source: Scanning
de_de: Wird gescannt
es_es: Escaneando
fr_fr: Numérisation

source: Semicolon
de_de: Semikolon
es_es: Punto y coma
fr_fr: Point-virgule

source: User
de_de: Benutzer
es_es: Usuario
fr_fr: Utilisateur

source: Tab
es_es: Pestaña
fr_fr: Onglet

source: Authentication Failed
de_de: Authentifizierung fehlgeschlagen
es_es: Error en la autenticación
fr_fr: Échec de l’authentification

source: Back
de_de: Zurück
es_es: Volver
fr_fr: Dos

source: Change Validity
de_de: Gültigkeit ändern
es_es: Cambiar validez
fr_fr: Validité de modification

source: Clear
de_de: Löschen
es_es: Borrar
fr_fr: Effacez

source: Enter authentication code
de_de: Authentifizierung eingeben
es_es: Introducir código de autenticación
fr_fr: Saisissez le code d’identification

source: Enter version here
de_de: Version hier eingeben
es_es: Introducir la versión aquí
fr_fr: Entrez la version ici

# PublishSP
source: Publish:
de_de: Veröffentlichen:
es_es: Publicar:
fr_fr: Publiez :

source: QRCode
es_es: Código QR
fr_fr: Code QR

source: Users
de_de: Benutzer
es_es: Usuarios
fr_fr: Utilisateurs

source: Username
de_de: Benutzername
es_es: Nombre de usuario
fr_fr: Nom d’utilisateur

# Valid
source: Validity
de_de: Gültigkeit
es_es: Validez
fr_fr: Validité

source: Validity Date
de_de: Gültigkeitsdatum
es_es: Fecha de validez
fr_fr: Date de validité

# VersionSP
source: Version:
es_es: Versión:

source: Abort Printing
de_de: Druck abbrechen
es_es: Abortar impresión
fr_fr: Abandonnez l’impression

source: Add Image
de_de: Bild hinzufügen
es_es: Añadir imagen
fr_fr: Ajouter image

source: Advance Image
de_de: Bildweiterschaltung
es_es: Avanzar imagen
fr_fr: Décalage de l’image

source: Close
de_de: Schließen
es_es: Cerrar
fr_fr: Fermez

source: ColorOffset
de_de: Farb-Offset
es_es: Compensación de color
fr_fr: Compensation de la couleur

source: Delay Image
de_de: Bildverzögerung
es_es: Retrasar imagen
fr_fr: Retardez l’image

source: Edit Jet Compensation
de_de: Strahlkompensation bearbeiten
es_es: Editar compensación del chorro
fr_fr: Modifiez la compensation des jets

source: Go to latest Message
de_de: Weiter zur letzten Meldung
es_es: Ir al último mensaje
fr_fr: Allez au dernier message

source: Go to oldest Message
de_de: Weiter zur ältesten Meldung
es_es: Ir al mensaje más antiguo
fr_fr: Allez au message le plus ancien

source: Head Distance
de_de: Kopfabstand
es_es: Distancia de cabezal
fr_fr: Distance entre les têtes

source: Head Distance Backwards
de_de: Kopfabstand rückwärts
es_es: Distancia de cabezal hacia atrás
fr_fr: Distance entre les têtes en arrière

source: Import Scan Check Values
de_de: Scanprüfwerte importieren
es_es: Importar valores de corrección del color
fr_fr: Importez les valeurs de contrôle du scan

source: Page Down
de_de: Seite unten
es_es: Página abajo
fr_fr: Page suivante

source: Page Up
de_de: Seite oben
es_es: Página arriba
fr_fr: Page précédente

source: Remove Image
de_de: Bild entfernen
es_es: Eliminar imagen
fr_fr: Supprimez l’image

source: Reset all Values
de_de: Alle Werte zurücksetzen
es_es: Restablecer todos los valores
fr_fr: Réinitialisez toutes les valeurs

source: Save Values
de_de: Wertespeicherung
es_es: Guardar valores
fr_fr: Enregistrez les valeurs

source: Stop Printing
de_de: Druck stoppen
es_es: Detener impresión
fr_fr: Arrêtez l’impression

# Error.01
source: E-Stop
de_de: Not-Aus
es_es: Parada de emergencia
fr_fr: Commutateur d’arrêt

# Error.02
source: CAUTION Webdyer overheated
de_de: VORSICHT Webdyer überhitzt
es_es: PRECAUCIÓN secador de la banda sobrecalentado
fr_fr: DANGER Surchauffe du Webdyer

# Error.03
source: CAUTION Beltheater overheated
de_de: VORSICHT Bandheizung überhitzt
es_es: PRECAUCIÓN calentador de la cinta sobrecalentado
fr_fr: DANGER Surchauffe du chauffe-bande

# Error.04
source: CAUTION Scanner enable signal missing
de_de: VORSICHT Scanner-Freigabesignal fehlt
es_es: PRECAUCIÓN Falta la señal de habilitación del escáner
fr_fr: DANGER Signal de validation du scanner manquant

# Error.05
source: CAUTION Headcrash, wrinkles in web
de_de: VORSICHT Kopfschaden, Papierfalten
es_es: PRECAUCIÓN Choque de cabezal, arrugas en la banda
fr_fr: DANGER Choc de tête, plis sur la bobine

# Error.06
source: CAUTION Speed was too high
de_de: VORSICHT Geschwindigkeit war zu hoch
es_es: PRECAUCIÓN la velocidad era demasiado alta
fr_fr: DANGER Vitesse trop élevée

# Error.07
source: CAUTION Positions on Scanner different
de_de: VORSICHT Positionen am Scanner unterschiedlich
es_es: PRECAUCIÓN Posiciones de precaución en el escáner diferentes
fr_fr: DANGER Positions différentes sur le scanner

# Error.08
source: E-Stop Button Unwinder Operator Side pressed
de_de: Not-Aus-Taste Abwickler-Bedienerseite gedrückt
es_es: Botón de parada de emergencia del lado del operador de la desbobinadora pulsado.
fr_fr: Bouton d’arrêt d’urgence du dérouleur côté opérateur pressé

# Error.09
source: E-Stop Button Unwinder Service Side pressed
de_de: Not-Aus-Taste Abwickler-Serviceseite gedrückt
es_es: Botón de parada de emergencia del lado del servicio de la desbobinadora pulsado.
fr_fr: Bouton d’arrêt d’urgence du dérouleur côté maintenance pressé

# Error.10
source: E-Stop Button Main Operator Side pressed
de_de: Not-Aus-Taste Hauptbedienerseite gedrückt
es_es: Botón de parada de emergencia del lado del operador principal pulsado.
fr_fr: Bouton d’arrêt d’urgence côté opérateur principal pressé

# Error.11
source: E-Stop Button Main Service Side pressed
de_de: Not-Aus-Taste Hauptserviceseite gedrückt
es_es: Botón de parada de emergencia del lado del servicio principal pulsado.
fr_fr: Bouton d’arrêt d’urgence côté maintenance principale pressé

# Error.12
source: E-Stop Button Rewinder Operator Side pressed
de_de: Not-Aus-Taste Aufwickler-Bedienerseite gedrückt
es_es: Botón de parada de emergencia del lado del operador de la rebobinadora pulsado.
fr_fr: Bouton d’arrêt d’urgence de l’enrouleur côté opérateur pressé

# Error.13
source: E-Stop Button Rewinder Service Side pressed
de_de: Not-Aus-Taste Aufwickler-Serviceseite gedrückt
es_es: Botón de parada de emergencia del lado del servicio de la rebobinadora pulsado
fr_fr: Bouton d’arrêt d’urgence de l’enrouleur côté maintenance pressé

# Error.14
source: Material in washing unit
de_de: Material im Waschgerät
es_es: Material en la unidad de lavado
fr_fr: Matériel dans l’unité de lavage

# Error.15
source: Airpressure is low
de_de: Luftdruck ist niedrig
es_es: La presión del aire es baja
fr_fr: La pression d’air est faible

# Error.16
source: Safety Door Main operator side opened
de_de: Hauptschutztür Bedienerseite geöffnet
es_es: Puerta de seguridad del lado del operador principal abierta
fr_fr: Porte de sécurité principale côté opérateur ouverte

# Error.17
source: Safety Door Main service side opened
de_de: Hauptschutztür Serviceseite geöffnet
es_es: Puerta de seguridad del lado del servicio principal abierta
fr_fr: Porte de sécurité principale côté maintenance ouverte

# Error.18
source: Safety Door Main left side opened
de_de: Hauptschutztür linke Seite geöffnet
es_es: Puerta de seguridad del lado izquierdo principal abierta
fr_fr: Porte de sécurité principale côté gauche ouverte

# Error.19
source: Safety Door Main right side opened
de_de: Hauptschutztür rechte Seite geöffnet
es_es: Puerta de seguridad del lado derecho principal abierta
fr_fr: Porte de sécurité principale côté droit ouverte

# Error.20
source: Belt out of positionError.20=Belt out of position
de_de: Riemen außerhalb der PositionError.20=Riemen außerhalb der Position
es_es: Cinta fuera de posiciónError.20=Cinta fuera de posición
fr_fr: Bande hors positionError.20=Bande hors position

# Error.21
source: Error after booted up first time
de_de: Fehler nach dem ersten Hochfahren
es_es: Error después de arrancar por primera vez
fr_fr: Erreur après le premier démarrage

# Error.22
source: Pressure Roller not down: Check cable
de_de: Andruckrolle nicht runter: Kabelprüfung
es_es: El rodillo de presión no está abajo: Comprobar cable
fr_fr: Le rouleau de pression ne descend pas : Vérifiez le câble

# ESTOP 00
source: ESTOP 00: Unwinder
de_de: NOT-AUS 00: Abwickler
es_es: PARADA DE EMERGENCIA 00: Desbobinadora
fr_fr: COMMUTATEUR D’ARRÊT 00 : Dérouleur

# ESTOP 01
source: ESTOP 01: Unwinder
de_de: NOT-AUS 01: Abwickler
es_es: PARADA DE EMERGENCIA 01: Desbobinadora
fr_fr: COMMUTATEUR D’ARRÊT 01 : Dérouleur

# ESTOP 02
source: ESTOP 02: Printer
de_de: NOT-AUS 02: Drucker
es_es: PARADA DE EMERGENCIA 02: Impresora
fr_fr: COMMUTATEUR D’ARRÊT 02 : Imprimante

# ESTOP 03
source: ESTOP 03: Printer
de_de: NOT-AUS 03: Drucker
es_es: PARADA DE EMERGENCIA 03: Impresora
fr_fr: COMMUTATEUR D’ARRÊT 03 : Imprimante

# ESTOP 04
source: ESTOP 04: Printer
de_de: NOT-AUS 04: Drucker
es_es: PARADA DE EMERGENCIA 04: Impresora
fr_fr: COMMUTATEUR D’ARRÊT 04 : Imprimante
