// ****************************************************************************
//
//	rx_def.h
//
// ****************************************************************************
//
//	Copyright 2013 by Radex AG, Switzerland. All rights reserved.
//	Written by Marcel Galliker 
//
// ****************************************************************************

#pragma once

#include "rx_ink_common.h"
#include "nios_def_fluid.h"
#include "cond_def_head.h"

#ifdef __cplusplus
extern "C"{
#endif

#pragma pack(1)

//--- initialisation ---------------------------------

void rx_def_init();
	
//--- File locatoions --------------------------------

#define PATH_ROOT_LX		"/opt/radex/"
#define PATH_BIN_LX			PATH_ROOT_LX "bin/"

#define PATH_ROOT_WIN		"D:/Radex/"
// #define PATH_BIN_WIN		PATH_ROOT_WIN "bin/"
#define PATH_SOURCE_DATA_DIR	"source-data/"
#define PATH_RIPPED_DATA_DIR	"ripped-data/"
#define PATH_RIPPED_DATA_DRIVE	"ripped-data:"
#define	PATH_EMBRIP_PRENV_DIR	"PrEnv/"

#ifdef WIN32
	#define PATH_ROOT			PATH_ROOT_WIN
	#define PATH_TRACE			PATH_ROOT "Trace/"
	#define PATH_TEMP			"D:/Temp/"
	#define PATH_HOME			"D:/radex/"
	#define PATH_SOURCE_DATA	"D:/" PATH_SOURCE_DATA_DIR
	#define PATH_RIPPED_DATA	"D:/" PATH_RIPPED_DATA_DIR
	#define PATH_EMBRIP_PRENV	"D:/" PATH_EMBRIP_PRENV_DIR
	#define PATH_FPGA_REGS		PATH_ROOT "fpga-regs"								
	#define PATH_USER			PATH_ROOT "user/"
	#define PATH_LOG			PATH_ROOT "log/"
#else
	#define PATH_ROOT			PATH_ROOT_LX
	#define PATH_HOME			"/home/radex/"
	#define PATH_TRACE			"/tmp/"
	#define PATH_TEMP			"/tmp/"
	#define PATH_USER			PATH_HOME "digiprint/"
	#define PATH_SOURCE_DATA	PATH_HOME PATH_SOURCE_DATA_DIR
	#define PATH_RIPPED_DATA	PATH_HOME PATH_RIPPED_DATA_DIR
	#define PATH_EMBRIP_PRENV	PATH_HOME PATH_EMBRIP_PRENV_DIR
	#define PATH_FPGA_REGS		PATH_HOME "fpga-regs/"				
	#define PATH_LOG			PATH_USER "log/"
#endif

#define PATH_BIN			PATH_ROOT "bin/"
#define PATH_BIN_MAIN		PATH_BIN  "main/"
#define PATH_BIN_SPOOLER	PATH_BIN  "spooler/"
#define PATH_BIN_HEAD		PATH_BIN  "head/"
#define PATH_BIN_FLUID		PATH_BIN  "fluid/"
#define PATH_BIN_ENCODER	PATH_BIN  "encoder/"
#define PATH_BIN_REXROTH	PATH_BIN  "rexroth/"
#define PATH_BIN_STEPPER	PATH_BIN  "stepper/"
#define PATH_BIN_WIN		PATH_BIN  "win/"

#define PATH_WAVE_FORM		PATH_ROOT "waveform/"

#define PATH_FONTS			PATH_TEMP "/Fonts/"

#define FIELNAME_HEAD_RBF		"rx_head_rbf"
#define FIELNAME_HEADTEMP_RBF	"rx_headtemp_rbf"
#define FIELNAME_HEAD_NIOS		"rx_head_nios"
#define FILENAME_HEAD_COND		"rx_head_cond"
#define FIELNAME_FLUID_RBF		"rx_fluid_rbf"
#define FIELNAME_FLUID_NIOS		"rx_fluid_nios"
#define FIELNAME_ENCODER_RBF	"rx_encoder_rbf"
#define FIELNAME_STEPPER_RBF	"rx_stepper_rbf"
#define FIELNAME_STEPPER_NIOS	"rx_stepper_nios"
#define FILENAME_SPOOLER_CTRL	"rx_spooler_ctrl"
#define FILENAME_LOG			"log.log"
#define FILENAME_NETWORK		"network.cfg"
#define FILENAME_PQ				"print_queue.xml"
#define FILENAME_CFG			"config.cfg"
#define FILENAME_FLUID_STATE	"fluid.xml"
#define FILENAME_HEADS_FLUSHED	"heads_flushed.xml"
#define FILENAME_PLC_CFG		"plc.cfg"
#define FILENAME_PLC_PAR		"plc.par"
#define FILENAME_MATERIAL		"material.xml"
#define FILENAME_MATERIAL_LIST	"materialList.xml"
#define FILENAME_SPLICE_PAR		"splicepar.xml"
#define FILENAME_HEAD_PRESOUT	"head_presout.xml"
#define FILENAME_COUNTERS		".counters.xml"

//--- defines ---------------------------------

#define INK_SUPPLY_CNT		24
#define MAX_HEADS_INKCYLINDER 12
#define ENC_CNT				2
#define FLUID_BOARD_CNT		4
#define FLUID_SCALE_SENSORS 3
#define INK_PER_BOARD		4
#define HEAD_CNT			4	// heads per head board
#define UDP_PORT_CNT		2
	
#define	MAX_HEADS_BOARD		4
#define MAX_GREY_LEVELS		8
#define MAX_DROP_SIZES		4
#define MAX_COLORS			16
#define MAX_SCALES			(MAX_COLORS+2)
#define MAX_HEADS_COLOR		48
#define MAX_HEAD_DIST		(INK_SUPPLY_CNT*MAX_HEADS_INKCYLINDER) // 288
#define MAX_DISABLED_JETS	32
#define MAX_DENSITY_VALUES	(2+10)
#define MAX_DENSITY_FACTORS	(2048+128)
	
#define HEAD_BOARD_CNT		(MAX_HEAD_DIST/MAX_HEADS_BOARD) // head boards per print bar

#define MAX_STEPPERS		4
#define MAX_STEPPER_MOTORS	5

#define IP_ADDR_SIZE		32

#define DPI_X				1200
#define DPI_Y				1200

#define MAX_DATA_SIZE		2048
#define MAX_TEST_DATA_SIZE	512

#define WAKEUP_BAR_LEN		128	// dots to wakeup lazy jets

//--- simple value ----------------------------------------------	
typedef struct SValue
{
	UINT32		no;
	INT32		value;
} SValue;

//--- device configuration --------------------
//--- devices -----------------------------------------------------------------
typedef enum EDevice
{
	dev_undef,	// 00
	dev_main,	// 01
	dev_gui,	// 02
	dev_plc,	// 03
	dev_enc,	// 04	
	dev_fluid,	// 05
	dev_6,		// 06
	dev_enc32,	// 07
	dev_8,		// 08
	dev_stepper,// 09
	dev_head,	// 10
	dev_spooler,// 11
	dev_end		// 13
} EDevice;
extern char *DeviceStr[];

typedef enum
{
	dev__undef,	// 00
	dev_off,	// 01
	dev_on,		// 02
	dev_simu	// 03	
} EPresent;

typedef enum ELogItemType
{
	LOG_TYPE_UNDEF,
	LOG_TYPE_LOG,
	LOG_TYPE_WARN,
	LOG_TYPE_ERROR_CONT,
	LOG_TYPE_ERROR_STOP,
	LOG_TYPE_ERROR_ABORT
} ELogItemType;
extern char *LogItemTypeStr[];

//--- ERectoVerso ------------------------------
typedef enum ERectoVerso
{
	rv_undef,	// 00
	rv_recto,	// 01
	rv_verso,	// 02
} ERectoVerso;

typedef struct SLogItem
{
	UINT8			deviceType;
	UINT8			deviceNo;
	UINT8			logType;	// ELogItemType
	UINT8			res1;
	UINT64			time;
	UINT32			errNo;
	UINT32			line;
	char			file[32];
	char			formatStr[256];
	BYTE			arg[256];
} SLogItem;

/*
typedef struct SVersion
{
	UINT32 major;		// 
	UINT32 minor;		// 
	UINT32 revision;	// SVN-Revision number 
	UINT32 build;		// incremented by each compilation
} SVersion;
*/
	
typedef struct SNetworkItem
{
	char	deviceTypeStr[32];
	char	serialNo[32];
	UINT64	macAddr;
	UCHAR	deviceType;
	INT8	deviceNo;
	char	ipAddr[32];
	UINT8	connected;
	UINT8	platform;	// EPlatform
	UINT32	rfsPort;
	UINT32	ports[8];
} SNetworkItem;

typedef struct SRxNetwork
{
	SNetworkItem item[64];
} SRxNetwork;

//--- SPageId -------------------------------
typedef struct SPageId
{
	INT32 id;
	INT32 page;
	INT32 copy;
	INT32 scan;
} SPageId;

//--- SPageNumber --------------------------------
typedef struct SPageNumber
{
	UINT32	enabled;
	UINT32	number;
	UINT32	fontSize;
	UINT32	imgDist;	// [µm]
} SPageNumber;

//--- print queue ----------------------------
typedef struct SPrintQueueItem
{
	SPageId	id;
	SPageId	start;

	char	filepath[256];
	char	preview [256];
	char	ripState[128];
	char	printEnv[64];
	char	material[64];
	char	testMessage[64];
	INT32	srcPages;
	INT32	srcWidth;	// µm
	INT32	srcHeight;	// µm
	UINT8	srcBitsPerPixel;
	INT32	firstPage;
	INT32	lastPage;
	INT8	singlePage;
	INT32	copies;
	INT8	collate;
	INT8	variable;	// variable data job
	UINT8	state;
			#define PQ_STATE_UNDEF		0
			#define PQ_STATE_QUEUED		1
			#define PQ_STATE_PREFLIGHT	2
			#define PQ_STATE_RIPPING	3
			#define PQ_STATE_SCREENING	4
			#define PQ_STATE_LOADING	5
			#define PQ_STATE_TRANSFER	6
			#define PQ_STATE_BUFFERED	7
			#define PQ_STATE_PRINTING	8
			#define PQ_STATE_PRINTED	9
			#define PQ_STATE_STOPPING	10	
			#define PQ_STATE_STOPPED	11

	UINT8	lengthUnit;
			#define PQ_LENGTH_UNDEF		0
			#define PQ_LENGTH_MM		1
			#define PQ_LENGTH_COPIES	2
			#define PQ_LENGTH_PIXELS	3
			
	UINT8	scanMode;
			#define PQ_SCAN_STD		0
			#define PQ_SCAN_RTL		1
			#define PQ_SCAN_BIDIR	2
	
	UINT8	orientation;
	UINT8	testImage;
			#define PQ_TEST_UNDEF			0
			#define PQ_TEST_ANGLE_OVERLAP	1
			#define PQ_TEST_ANGLE_SEPARATED	2
			#define PQ_TEST_JETS			3
			#define PQ_TEST_JET_NUMBERS		4
			#define PQ_TEST_GRID			5
			#define PQ_TEST_ENCODER			6
			#define PQ_TEST_SCANNING		7
			#define PQ_TEST_FULL_ALIGNMENT	8
			#define PQ_TEST_DENSITY			9

	INT32	pageWidth;	// µm
	INT32	pageHeight;	// µm
	INT32	pageMargin;	// µm
	INT32	printGoMode;
			#define PG_MODE_MARK		1	// print mark to PG (IN[0])
			#define PG_MODE_LENGTH		2	// distance between two GPs
			#define PG_MODE_GAP			3	// gap getween images
			#define PG_MODE_MARK_FILTER	4	// print mark to PG (IN[0])
			#define PG_MODE_MARK_VRT	5	// print mark to PG (IN[1])
			#define PG_MODE_MARK_INV	6	// print mark to PG (IN[0]/INVERSE)
	
	INT32	printGoDist;
	INT32	scanLength; // mm
	INT8	passes;
	INT8	virtualPasses;
	INT8	penetrationPasses;
	INT8	curingPasses;
	INT32	scans;
	INT32	speed;
	INT32	copiesTotal;
	INT32	copiesPrinted;
	INT32	scansSent;
	INT32	scansPrinted;
	INT32	scansStart;
	INT32	scansTotal;
	INT32	scansStop;
	INT32	progress;
	SPageNumber pageNumber;
	INT32	checks;

	char    dots[4];
	INT8	wakeup;

//	UINT16	previewOrientation;
} SPrintQueueItem;

// --- SColorConfig --------------------------------------------
typedef struct
{
	int			colorCode; // 0 to sizeof RX_ColorName
	char		name[64]; // colorname used in pdf i.e.: Cyan, Magenta, Yellow, Black, Blue, Orange, Green, Spot1, Micr ...
	char		shortName[8];	// file extension
	UINT8		rgbR;	// 0 to 0xFF used to simulated color in rgb for display
	UINT8		rgbG;	// "
	UINT8		rgbB;	// "
	int			technical; // color is technical type: 0: no, 1: yes
	int			penetrationFluid; // color is penetrationFluid type: 0: no, 1: yes
	int			inMaxInk; // color to be compute to calculate TotalMaxInk
	int			preserveBlack; // color for preserveBlack for APPE
	int			dieCutType; // color for dieCut for APPE
	int			mergeInBlack; // color to merge in black (plane 3)
	int			outRectoIdx; // outputpath for recto color plane idx. Default: 0
	int			outVersoIdx; // outputpath for recto color plane idx. Default: same as Recto
	int			DropSize[3];	// size of drop 1, 2 and 3 in femtoliter (10 exp-15)
} SColorConfig;

typedef struct SPoint
{
	INT32	x;
	INT32	y;
} SPoint;

#define MAX_OUTPATH 8
// --- SColorSpaceConfig --------------------------------------------
typedef struct
{
	char		name[64];
	int			duplex;		// 0:no, 1:yes
	SPoint		resol;
	int			count;
	INT64		maxWidth;
	SColorConfig color[MAX_COLORS];
	int			defDropSize[3];	// default size of drop 1, 2 and 3 in femtoliter (10 exp-15)
	int			outPathInit;
	int			countPath;
	char		outPath[MAX_OUTPATH][2 * MAX_PATH];
} SColorSpaceConfig;

//--- Colornames ------------------------------
typedef struct 
{
	int code;
	char name[32];
	char shortName[8];
}  SColorName;
	
//--- ColorName --------------------------------
extern SColorName RX_ColorName[55];
void RX_ColorNameInit (int inkSupplyNo, ERectoVerso	rectoVerso, char *fileName, int colorCode);
const char* RX_ColorNameLong (int code); 
const char* RX_ColorNameShort(int inkSupplyNo);

//--- SInkDefinition ------------------------------
typedef struct
{
	UINT16	pos;
	UINT16	volt;
} SWfPoint;
#define MAX_WF_POINTS	32
	
	// first pulse can start at this position
#define WF_FIRST_PULSE_POS	144 // 1.80 µs@160MHz
								// 2.06 µs@140MHz minimum 2.0 (140)
								
#define WF_FILLER	68			// delay of Waveform DAC OLD_OFF_OFFSET - OLD_WF_OFFSET

typedef struct SInkDefinition
{
	char	family[64];
	char	fileName[64];
	char	name[64];
	char	description[128];
	UINT32	colorRGB;
	UINT32	colorCode;
	INT32	temp;
	INT32	tempMax;
	INT32	tempChiller;
	INT32	dropletVolume;
	INT32	meniscus;
	INT32	viscosity;
	INT32	dropSpeed;
	INT32	printingSpeed[8];
	INT32	flushTime[3];
	INT32	maxSpeed[MAX_DROP_SIZES];
	UINT8	greyLevel[MAX_DROP_SIZES];
	SWfPoint wf[MAX_WF_POINTS];
} SInkDefinition;

typedef struct SInkLicense
{
	UINT16	machineID;
	UINT16	inkID;
	UINT16	licNo;
	UINT16	code_1;
	UINT32	volume;
	UINT16	code_2;
	UINT16	crc16;
} SInkLicense;
	
typedef struct SOffsetCfg
{
	INT32	angle;			// to adjust angle fault
	INT32	step;			// to adjust step fault
	INT32	incPerMeter[2];	// increments per meter
	INT32	versoDist;
	INT32	manualFlightTimeComp;
} SOffsetCfg;

int rx_def_is_scanning(EPrinterType printerType);
int rx_def_is_tx(EPrinterType printerType);
int rx_def_is_lb(EPrinterType printerType);
int rx_def_is_tts(EPrinterType printerType);
int rx_def_is_test(EPrinterType printerType);
int rx_def_use_pq(EPrinterType printerType);

int rx_printMode_is_test(int printMode);

typedef struct SPrinterCfg
{
	EPrinterType	type;

	UINT16	inkSupplyCnt;

	UINT32  jetEnabled0;
	UINT32	jetEnabledCnt;

	INT32	bmpOffsetUM;	// [µm]
	INT32	bmpHeightUM;	// [µm]
	INT32	bmpLengthUM;	// [µm]
	UINT8	forwardBack;
	UINT8	upwardDown;
	
	UINT32	overlap;
	
	SOffsetCfg offset;
} SPrinterCfg;

typedef enum
{
	ps_undef,		// 00
	ps_off,			// 01
	ps_ready_power, // 02
	ps_printing,	// 03
	ps_stopping,	// 04
    ps_goto_pause,  // 05
    ps_pause,       // 06
    ps_cleaning,    // 07
	ps_webin,		// 08
	ps_setup,		// 09
} EPrintState;

extern char *PrintStateStr[];

typedef struct SPrinterStatus
{
	EPrintState		printState;
	UINT8			error;

	//--- flags --------------------------
	union
	{
		struct
		{
		UINT32			cleaning:1;			// 0x0001
		UINT32			dataReady:1;		// 0x0002
		UINT32			splicing:1;			// 0x0004
		UINT32			inkSupilesOff:1;	// 0x0008
		UINT32			inkSupilesOn:1;		// 0x0010
		UINT32			testMode:1;			// 0x0020
		UINT32			externalData:1;		// 0x0040
		UINT32			txRobot:1;			// 0x0080
		UINT32			tempReady:1;		// 0x0100
		UINT32			lbRobot : 1;		// 0x0200
        UINT32			NeedDegasser : 1;   // 0x0400
        UINT32			door_open : 1;		// 0x0800
        };
		UINT32 flags;		
	};
	//--- flags end -------------------------
	
	UINT32			sentCnt;
	UINT32			transferredCnt;
	UINT32			printGoCnt;
	UINT32			printedCnt;
	UINT32			maxSpeed[MAX_DROP_SIZES];	// [m/min]
	UINT32			actSpeed;
	INT64			counterAct;	// [mm]
    INT64			counterTotal;	// [mm]
}  SPrinterStatus;

//--- SSpoolerCfg ----------------------------------
typedef struct SSpoolerCfg
{
	//--- data blocks per head board 
	INT32	dataBlkSize;
	INT32	dataBlkCntHead;

	INT32	printerType;	// EPrinterType
	INT32	overlap;

	//--- nozzles per printhead ---
	INT32	headWidthPx;
	INT32	headOverlapPx;
	INT32	barWidthPx;
	INT32	maxOffsetPx;

	//--- nozzles per color ---
	INT32   barStartPx;		// printbar first pixel		
	INT32   barEndPx;		// printbar last pixel

	INT32	colorCnt;
	INT32	headsPerColor;
	INT32	headsPerBoard;
	UINT32	resetCnt;

	//--- network -----------------------------
	char	dataRoot[MAX_PATH];	// network path

	//--- first printhead per color ---
	// INT32	firstHead[MAX_COLORS];
	INT16	headNo	   [MAX_COLORS][MAX_HEADS_COLOR];
//	INT8	board	   [MAX_COLORS][MAX_HEADS_COLOR];
//	INT8	headOnBoard[MAX_COLORS][MAX_HEADS_COLOR];
//	INT32	blockNo0   [MAX_HEADS_BOARD];
} SSpoolerCfg;

typedef struct SConditionerCfg
{
	INT32	meniscus_setpoint;
	INT32	headsPerColor;
} SConditionerCfg;
	
//--- print head ---------------------------- 
typedef struct SHeadCfg
{
	UINT8	inkSupply;
	UINT8	_headNo_unused;	// within color
	UINT8	enabled;
	UINT8	encoderNo;
	INT32	dist;	// [µm] distance correction inside print bar 
	INT32	distBack;	// [µm] distance correction inside print bar
	INT32	headHeight;	// [µm] height of printhead above substrate
	UINT16	jetEnabled0;
	UINT16  jetEnabledCnt;
//	UINT32	bmpJetOffset;
//	UINT32  bmpJetCnt;
	
	UINT32	blkNo0;
	UINT32	blkCnt;
	
	SConditionerCfg cond;

	char	name[8];
} SHeadCfg;

typedef struct SHeadInfo
{
	UINT32 connected : 1;
	UINT32 flushed   : 1;
	UINT32 meniscus : 1;
    UINT32 info_3 : 1;
    UINT32 info_4 : 1;
    UINT32 info_5 : 1;
	UINT32 info_6 : 1;
	UINT32 info_7 : 1;
	UINT32 info_8 : 1;
	UINT32 info_9 : 1;
	UINT32 info10 : 1;
	UINT32 info11 : 1;
	UINT32 info12 : 1;
	UINT32 info13 : 1;
	UINT32 info14 : 1;
	UINT32 info15 : 1;
	UINT32 info16 : 1;
	UINT32 info17 : 1;
	UINT32 info18 : 1;
	UINT32 info19 : 1;
	UINT32 info20 : 1;
	UINT32 info21 : 1;
	UINT32 info22 : 1;
	UINT32 info23 : 1;
	UINT32 info24 : 1;
	UINT32 info25 : 1;
	UINT32 info26 : 1;
	UINT32 info27 : 1;
	UINT32 info28 : 1;
	UINT32 info29 : 1;
	UINT32 info30 : 1;
	UINT32 info31 : 1;
} SHeadInfo;

typedef enum
{
	info_is_shutdown			= 0x00000001,
	info_wf_ready				= 0x00000002,
	info_nios_ready				= 0x00000004,
	info_watchdog_dbg_mode      = 0x00000008,
	info_watchdog_catch_fp_err	= 0x00000010,
	info_cooler_pcb_present		= 0x00000020,
	info_6           = 0x00000040,
	info_7           = 0x00000080,
	info_8           = 0x00000100,
	info_9           = 0x00000200,
	info10           = 0x00000400,
	info11           = 0x00000800,
	info12           = 0x00001000,
	info13           = 0x00002000,
	info14           = 0x00004000,
	info15           = 0x00008000,
	info16           = 0x00010000,
	info17           = 0x00020000,
	info18           = 0x00040000,
	info19           = 0x00080000,
	info20           = 0x00100000,
	info21           = 0x00200000,
	info22           = 0x00400000,
	info23           = 0x00800000,
	info24           = 0x01000000,
	info25           = 0x02000000,
	info26           = 0x04000000,
	info27           = 0x08000000,
	info28           = 0x10000000,
	info29           = 0x20000000,
	info30           = 0x40000000,
	info31           = 0x80000000,
} EHeadinfo;
	
typedef enum
{
	warn_fpga_overheating = 0x00000001,	// head is overheating
	warn_flow_factor	  = 0x00000002,
	warn_2			 = 0x00000004,
	warn_3			 = 0x00000008,
	warn_4			 = 0x00000010,
	warn_5			 = 0x00000020,
	warn_6			 = 0x00000040,
	warn_7			 = 0x00000080,
	warn_8			 = 0x00000100,
	warn_9			 = 0x00000200,
	warn10			 = 0x00000400,
	warn11			 = 0x00000800,
	warn12			 = 0x00001000,
	warn13			 = 0x00002000,
	warn14			 = 0x00004000,
	warn15			 = 0x00008000,
	warn16			 = 0x00010000,
	warn17			 = 0x00020000,
	warn18			 = 0x00040000,
	warn19			 = 0x00080000,
	warn20			 = 0x00100000,
	warn21			 = 0x00200000,
	warn22			 = 0x00400000,
	warn23			 = 0x00800000,
	warn24			 = 0x01000000,
	warn25			 = 0x02000000,
	warn26			 = 0x04000000,
	warn27			 = 0x08000000,
	warn28			 = 0x10000000,
	warn29			 = 0x20000000,
	warn30			 = 0x40000000,
	warn31			 = 0x80000000,
} EHeadWarn;

typedef enum EHeadNiosErr
{
	err_nios_incompatible		= 0x00000001,
	err_fpga_overheated			= 0x00000002,
	err_cooler_overheated		= 0x00000004,
	err_cooler_overpressure		= 0x00000008,
	err_encoder_not_conected	= 0x00000010,
	err_fpga_state_machines		= 0x00000020,
	err_not_in_print			= 0x00000040,
	err_PG_0					= 0x00000080,
	err_PG_1					= 0x00000100,
	err_PG_2					= 0x00000200,
	err_PG_3					= 0x00000400,
	err_36volt					= 0x00000800,
	err_firepulse_missed_0		= 0x00001000,
	err_firepulse_missed_1		= 0x00002000,
	err_firepulse_missed_2		= 0x00004000,
	err_firepulse_missed_3		= 0x00008000,
	err_2_5volt					= 0x00010000,
	err_17						= 0x00020000,
	err_fifo_full_0				= 0x00040000,
	err_fifo_full_1				= 0x00080000,
	err_tcpip_overflow			= 0x00100000,
	err_therm_cooler		    = 0x00200000,
	err_22						= 0x00400000,
	err_23						= 0x00800000,
	err_amc7891					= 0x01000000,
	err_3_3_volt				= 0x02000000,
	err_5volt					= 0x04000000,
	err_min_5volt				= 0x08000000,
	err_pwr_all_off				= 0x10000000,
	err_amp_all_on				= 0x20000000,
	err_pwr_all_on				= 0x40000000,
	err_31						= 0x80000000,
} EHeadNiosErr;

	
typedef struct
{
	//--- fuji eeprom ---------------------------------
	UINT32			serialNo;
	UINT8			week;
	UINT8			year;
	UINT8			flowResistance;
	UINT8			straightness;
	INT16			uniformity;
	UINT16			voltage;
	UINT16			dropSize[3];
	UINT16			badJets[8];
} SHeadEEpromInfo;

typedef struct
{
	UINT16	clusterNo;			//	0x00
	UINT16	flowResistance;		//	0x02
	UINT8	flowResistanceCRC;	//	0x04
	UINT32	dropletsPrinted_old;	//  0x05..0x08
	UINT8	dropletsPrintedCRC_old;	//	0x09
	INT16	disabledJets[MAX_DISABLED_JETS];	// 0x0a..0x4b
	UINT8	disabledJetsCRC;					//	0x4a
	INT16	densityValue[MAX_DENSITY_VALUES];	// 0x4b..0x62
	UINT8	densityValueCRC;					// 0x63
	UINT8	voltage;							// 0x64: Firepulse voltage
	UINT8	voltageCRC;							// 0x65
	UINT64	dropletsPrinted;					// 0x66..0x6d
	UINT8	dropletsPrintedCRC;					// 0x6e
	INT16	rob_angle;							// 0x6f..0x70	// 0=undef
	INT16	rob_dist;							// 0x71..0x72	// 0=undef
	UINT8	rob_CRC;							// 0x73
	UINT8	res_74[0x80-0x74];	
} SHeadEEpromMvt;	// size must be 0x80!!
	
typedef struct SHeadStat
{	
	SCondInfo		info;
	EHeadWarn		warn;
	UINT32			err;	// conditioner --> cond_def_head.h

	//-- job info ------------------------------------
	UINT64	dotCnt;	// printed drops since last reset
	UINT32	imgInCnt;
	UINT32	imgBuf;
	UINT32	encPos;
	UINT32	encPgCnt;
	UINT32	printGoCnt;
	UINT32	printDoneCnt;

	//--- ink system ---------------------------------
	UINT32			tempHead;
	UINT32			tempCond;
	UINT32			tempSetpoint;
	INT32			presIn;
	INT32			presIn_max;
	INT32			presIn_diff;
	INT32			flowFactor;
	INT32			presOut;
	INT32			presOut_diff;
	INT32			meniscus;
	INT32			meniscus_diff;
	INT32			meniscus_Setpoint;
	INT32			pid_offset;

	FLOAT			dropVolume;	// in pl
	UINT32			pumpSpeed;
	UINT32			pumpFeedback;
	UINT32			printingSeconds;
	UINT64			printedDroplets;
	UINT64			printed_ml;

	INT32			presIn_0out;
	EnFluidCtrlMode	ctrlMode;
	
	SHeadEEpromInfo	eeprom;
